[
    {
        "name": "Vegan Soy Sauce Caramel",
        "servings": "3/4 cup",
        "ingredients": [
            "1/3 cup full fat coconut milk (132ml)",
            "1/2 cup coconut sugar (108g)",
            "2 tbsp + 1 tsp soy sauce (35-40ml)",
            "1 tsp vanilla extract, optional",
            "3/4 cup vegan caramel sauce (180g)",
            "2 tbsp soy sauce (30g)"
        ],
        "instructions": [
            "Into a sauce pan over medium, add in the coconut milk and sugar stirring until sugar is dissolved. The mixture will start to bubble and thicken, continue to stir so the bottom does not burn (about 5-8 minutes). Remove from heat and stir in soy sauce and vanilla extract. ",
            "Serve immediately or keep in the refrigerator for up to one week. This caramel sauce will thicken as it cools but still be pourable and drizzle-able. ",
            "If caramel sauce is thick, microwave it for 10-15 seconds until stir-able. Add in the soy sauce and whisk until well combined. Serve and enjoy! "
        ],
        "link": "https://okonomikitchen.com/vegan-soy-sauce-caramel",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/07/soy-sauce-caramel-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Sunomono (Japanese Cucumber Salad)",
        "servings": "2 servings",
        "ingredients": [
            "2 tsp dried wakame (3g)",
            "1/4 of a bundle of mung bean noodles (6g)",
            "2 Persian cucumbers or 1 Japanese cucumber (120g)",
            "1.5 tbsp rice vinegar (22g)",
            "1 tsp cane sugar (5g)",
            "3/4 tsp soy sauce",
            "1 tsp sesame seeds (5g)"
        ],
        "instructions": [
            "Pour boiled water over wakame and mung bean noodles, fully submerged. Let it sit for 5-8 minutes, until wakame has expanded and noodles are softened. Pat them dry and then cut the noodles 3 times with kitchen scissors so there are not long pieces.",
            "Slice the tips off the cucumbers and thinly slice them into rounds. Using a mandolin is ideal here (faster and more consistent slices). Add 1 tsp of salt and rub it into the cucumbers using your hands. Let it sit for 3-5 minutes and then rinse, drain and blot them to remove excess water. ",
            "Into a bowl, add the rice vinegar, cane sugar, soy sauce and stir well. ",
            "Add the cucumbers, wakame and noodles into the sauce mix and toss well. Garnish with sesame seeds and enjoy!"
        ],
        "link": "https://okonomikitchen.com/sunomono-japanese-cucumber-salad",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/07/sunomono-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Matcha Chocolate Chip Cookies",
        "servings": "12 cookies",
        "ingredients": [
            "1/2 cup drippy cashew butter (120g // or tahini)",
            "1/3 cup maple syrup (100g // or use 1/4 cup maple syrup + 1/4 cup granulated sugar for crispier cookies)",
            "1/4 cup aquafaba (60ml)",
            "1 tsp vanilla extract (5g)",
            "1/3 cup rice flour (54g)",
            "1/2 cup oat flour (60g // homemade or store bought)",
            "2 tbsp tapioca starch (15g)",
            "1 1/2 tsp premium matcha powder (7g)",
            "1 1/2 tsp baking powder (7g)",
            "1/4 tsp salt ",
            "1/3 cup chocolate chips (60g)"
        ],
        "instructions": [
            "Pre-heat oven to 350 F. Line a light coloured baking tray with parchment paper. ",
            "Into a mixing bowl, add in the tahini, maple syrup, cane sugar, aquafaba, vanilla and whisk until well combined.",
            "Add in the rice flour, oat flour, tapioca starch and alt. Sift in the matcha and baking powder and mix until combined. Fold in chocolate chips.",
            "Use a small cookie scoop and divide into 12 balls (see notes below for stickiness). Bake for 10 minutes. Let them cool on the baking tray for 2 minutes and then transfer to a wire rack to cool.  "
        ],
        "link": "https://okonomikitchen.com/vegan-matcha-chocolate-chip-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/06/vegan-chocolate-chip-matcha-cookies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Cashew Buttercream Frosting",
        "servings": "1 1/2 cups",
        "ingredients": [
            "1 cup raw cashews, soaked for 30 minutes (130g)",
            "1/3 cup coconut cream (80g)",
            "5–6 tbsp powdered cane sugar (40-50g)*",
            "1.5 tbsp lemon juice (22g)",
            "3/4 tsp miso paste, optional (4g)",
            "1 tsp vanilla extract (50g)",
            "1/8 tsp salt ",
            "4 tbsp coconut butter (60g)"
        ],
        "instructions": [
            "Drain the cashews from the soaking water well and pat dry with a clean kitchen towel. Add all the ingredients except the coconut butter into a high speed blender and blend until smooth and creamy. Scrape down the sides of the blender as needed. Add in the coconut butter and blend until combined. ",
            "Place into the freezer for 30 minutes and then use a electric hand mixer to whip until fluffy. If it’s too firm to whisk, let it sit for 3-5 minutes. Freeze again for 15-20 minutes and whip again until fluffy. Repeat one more time and then chill in the refrigerator before frosting. ",
            "Cover the buttercream and place in the refrigerator until ready to use for up to 1 week. If freezing, pack it into a freezer safe bag or container, cover and freeze for up to 1 month.",
            "The texture and consistency of this buttercream is very similar to the traditional kind where it will hold up for 1-3 hours but will start melting if the temperature is too warm. It tastes the best chilled as well so I do recommend frosting right before serving!  "
        ],
        "link": "https://okonomikitchen.com/vegan-cashew-buttercream-frosting",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/06/vegan-cashew-buttercream-frosting-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan BLT Pasta Salad",
        "servings": "4 servings",
        "ingredients": [
            "8 oz tempeh (224g)",
            "1 batch smoky marinade",
            "1/3 cup vegan mayo (82g // store bought or homemade)",
            "1/2 cup vegan ranch (120g // store bought or homemade)*",
            "8 oz gluten free pasta (224g // I love this one)",
            "1 cup cherry tomatoes, sliced in half (150g)",
            "3–4 cups lettuce, chopped (200g)",
            "1/8 cup thinly sliced red onion soaked in water (30g)",
            "1 medium avocado, optional (120g)"
        ],
        "instructions": [
            "Slice tempeh into strips and then pour smoky marinade over. Let it marinate 15 minutes (better for longer or overnight). When ready, pan fry over medium high heat for 3 minutes. Flip the tempeh and cook for another 3-5 minutes until slightly browned and marinate has fully cooked off. If you would like a baked or air fried version, see my tempeh cooking guide on how to make it. Slice the tempeh bacon into bite size pieces or into ‘bacon crumbles’. ",
            "Mix vegan ranch and vegan mayo together until combined.",
            "Cook pasta following instructions, rinse with water and add to a large salad mixing bowl. Add in cherry tomatoes, lettuce and red onions. Pour the sauce in and toss. Add the tempeh bacon and avocado if using and gently toss. Serve and enjoy! "
        ],
        "link": "https://okonomikitchen.com/vegan-blt-pasta-salad",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/06/vegan-blt-pasta-salad-recipe-with-tempeh-bacon-1-of-1-1024x683.jpg"
    },
    {
        "name": "Tandoori Tempeh Bowls (Vegan + Gluten Free)",
        "servings": "2 servings",
        "ingredients": [
            "1 batch of tandoori tempeh marinade",
            "1 package of tempeh (224)",
            "1/2 cup quinoa, dry (100g)",
            "1/2 small onion, diced finely (30g)",
            "1/2 large english cucumber (100g)",
            "1 lemon, juiced (45-60ml)",
            "1 bunch of cilantro (38-56g)",
            "2 tbsp raisins (20g)",
            "1/2 tsp cumin",
            "1/4 tsp garlic powder",
            "1/4 tsp red pepper flakes",
            "cilantro",
            "non-dairy yogurt",
            "non-dairy sour cream",
            "avocado",
            "scallions"
        ],
        "instructions": [
            "Slice tempeh into desired pieces. Pour prepared marinade over tempeh in a shallow bowl and let it sit for at least 15 minutes. ",
            "Bring 1 cup of water or vegetable broth to a boil over medium high heat. Once boiling, add in rinsed quinoa and lower heat to a simmer. Place the lid on and cook for about 15 minutes or until all the water is absorbed. Fluff with a fork and remove from heat.",
            "Place the tempeh in air fryer basket and air fry for 14-15 minutes, flipping half way. See this post for details on cooking tempeh and other methods.  ",
            "While quinoa and tempeh is cooking, dice the onions and soak in cold water (this gets rid of the strong raw onion flavour). Cut the top of the cucumber and then slice lengthwise. Scrape out the seeds and then dice into 1 cm cubes. Add cucumber, onions, cilantro, 1/2 a juice of a lemon and red pepper flakes to a bowl and toss. Season with salt and pepper. Set aside.",
            "Once quinoa is finished cooking, add in raisins and remaining lemon juice and cilantro. Add in garlic powder, cumin, salt and pepper to taste. ",
            "Assemble bowls. Add quinoa to a bowl, cucumber salad and top with tempeh. Top with vegan sour cream or garlic yogurt and more cilantro. Serve and enjoy!"
        ],
        "link": "https://okonomikitchen.com/tandoori-tempeh-bowls-vegan-+-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/06/vegan-tandoori-tempeh-quinoa-bowls-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Cinnamon Toast Crunch",
        "servings": "4 Servings",
        "ingredients": [
            "1 cup oat flour  (120g)",
            "2/3 cup almond flour (75g)",
            "2 tbsp flax meal, optional (15g) ",
            "1/3 cup water + additional water for brushing (80ml)*",
            "2–3 tbsp apple sauce (30g)",
            "2 1/2 tsp cinnamon (12g)",
            "1/3 cup granulated sugar (68g // cane, coconut or maple sugar)",
            "1/4 tsp salt"
        ],
        "instructions": [
            "Pre-heat oven to 375 F (190 C). ",
            "Mix the 2 tsp of cinnamon and the sugar together in a bowl and set aside. ",
            "Mix together oat flour, almond flour, flax meal, cinnamon and salt. Add in the water and lesser amount of apple sauce and stir until a roll-able dough forms. If its too dry, add in extra tbsp of apple sauce. If you still find it not coming together, add 1 tsp of water at a time (the amount of liquid you will need to add depends on the humidity of your kitchen). You want a dough that you can roll out (so not too wet) but also not crumbling apart. It should kind of has the texture of pie dough. ",
            "Place the dough between two pieces of parchment paper and then roll the dough into a very thin sheet (1.5 – 2 mm). Brush with water or aquafaba and then generously coat with cinnamon sugar. Place the parchment paper back on top and then carefully flip to the other side. Peel the parchment paper off the dough, brush with water and then sprinkle with more cinnamon sugar. This time, place the parchment paper back on top and roll once– this ensures the cinnamon sugar sticks to the dough.",
            "Using a pizza cutter or very sharp knife, cut the dough into 1/2 – 3/4 inch squares. Separate the pieces of dough and place on to lined baking tray (I just place the parchment paper I was using to roll it out). Gather the scraps and repeat the process starting from rolling out until you’ve used up all your dough. ",
            "Bake for 9-12 minutes, keeping a very close eye on them for the last 3 minutes. They go from perfectly crispy brown to burnt in seconds! ",
            "Remove from the oven and let them fully cool before serving (they crisp up as they cool even more). ",
            "Serve with your favourite non dairy milk or store in a air tight container for up to 2 days. After 2 days, they do tend to get a little softer in texture. "
        ],
        "link": "https://okonomikitchen.com/vegan-cinnamon-toast-crunch",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/06/vegan-cinnamon-toast-crunch-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Peanut Noodle Salad with Satay Tempeh",
        "servings": "2 servings",
        "ingredients": [
            "8 oz tempeh (224g)",
            "1 portion of satay marinade",
            "6 oz gluten free ramen noodles (168g // or any noodles of choice)",
            "1/2 english cucumber, thinly sliced (150g)",
            "1 bell pepper, thinly sliced (175g)",
            "1/4–1/3 cup homemade peanut sauce",
            "cilantro",
            "green onions",
            "sesame seeds"
        ],
        "instructions": [
            "Tear (or cube) tempeh into small to medium chunks with your hands. Add to a shallow bowl along with the marinade and toss until tempeh pieces are coated. Let the tempeh marinate for at least 15 minutes.\n\nAir Fryer Method: Pre-heat air fryer at 375 F. Add tempeh pieces to basket and air fry for 7 minutes. Shake the basket or flip the tempeh and air fry for another 5-7 minutes or until crispy. \nOven Baked Method: Pre-heat oven to 400 F. Add tempeh to silpat or parchment lined baking tray and bake for 12 minutes. Scatter and flip the tempeh pieces and bake for another 10 minutes or until crispy.\n\n",
            "Air Fryer Method: Pre-heat air fryer at 375 F. Add tempeh pieces to basket and air fry for 7 minutes. Shake the basket or flip the tempeh and air fry for another 5-7 minutes or until crispy. ",
            "Oven Baked Method: Pre-heat oven to 400 F. Add tempeh to silpat or parchment lined baking tray and bake for 12 minutes. Scatter and flip the tempeh pieces and bake for another 10 minutes or until crispy.",
            "While the tempeh is cooking, bring a pot of water to a boil. Cook noodles following manufactures directions. Once noodles are cooked, drain the water and add them to a bowl of cold water to stop them from over cooking. During this time, prepare and slice the veggies. ",
            "Add ramen noodles, veggies and peanut sauce to a bowl and toss until everything is coated in the sauce. Add tempeh pieces and give it another quick toss. ",
            "Serve with cilantro, sliced green onions, sesame seeds and lime juice and enjoy!"
        ],
        "link": "https://okonomikitchen.com/peanut-noodle-salad-with-satay-tempeh",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/05/ramen-noodle-salad-with-peanut-sauce-1-of-1-1024x683.jpg"
    },
    {
        "name": "5 Easy Marinades for Tempeh",
        "servings": "No servings data",
        "ingredients": [
            "1/2 cup non-dairy yogurt (125g // or full fat coconut milk // add 2–3 tbsp of non dairy milk if using a thick yogurt) ",
            "1/2 lemon, juiced (30g)",
            "1/2 tbsp maple syrup (10g)",
            "3 minced garlic cloves ( 9g // or 1.5 tsp garlic powder)",
            "1 tbsp minced ginger (15g // or 1/2 tsp ground ginger)",
            "1/2 tbsp paprika ",
            "1.5 tsp garam masala",
            "1 tsp cumin",
            "1 tsp coriander",
            "1/2 tsp turmeric",
            "1/4 tsp cayenne",
            "1 tsp salt ",
            "1/2 tsp black pepper",
            "1/4 cup coconut milk (60ml)",
            "2 tsp red curry paste (10g)",
            "1.5 tsp coconut sugar (6g)",
            "1.5 tbsp soy sauce (22g)",
            "2 garlic clove, minced (6g)",
            "2 tsp ginger grated (10g)",
            "2 tsp curry powder ",
            "1/4 cup tamari (60g // or soy sauce)",
            "2 tbsp maple syrup (40g)",
            "1 tsp liquid smoke (5g)",
            "1/2 tsp smoked paprika",
            "1/4 tsp black pepper",
            "1/2 tsp garlic powder, optional",
            "1/4 cup low sodium tamari  (60ml // or soy sauce)",
            "2 tbsp coconut sugar (24g)",
            "1 tbsp sesame oil (15g)",
            "1 scallion, chopped (10g)",
            "3 tbsp apple sauce (45g)",
            "3 minced garlic clove (9g)",
            "½ tbsp sesame seeds (7g)",
            "1 tbsp grated ginger (15g)",
            "1 tsp black pepper",
            "½ tsp Korean red pepper flakes, optional",
            "1/2 cup non dairy yogurt (125ml)",
            "2 tbsp non dairy milk (30g) ",
            "1/2 lemon, juiced (30g)",
            "2 garlic clove, minced (6g)",
            "1/2 tbsp ginger, grated (10g)",
            "1 tsp smoked paprika",
            "1 tsp sweet paprika",
            "1/2 tsp cumin",
            "1/4 tsp cinnamon ",
            "1/2 tsp black pepper",
            "1 tsp salt",
            "1/8 tsp cayenne, optional "
        ],
        "instructions": [
            "For each marinade, add all the ingredients into a bowl and stir until combined. Alternatively, add all the ingredients into a air tight jar and shake until combined. You can either store the marinade in the refrigerator or freezer as is or marinade the tempeh (steps below). ",
            "Add marinade over tempeh in a freezer safe container or bag and toss until tempeh is fully coated in the marinade. Each marinade is enough for 1 8 oz package of tempeh. ",
            "Immediate Use: Refrigerate and let the tempeh marinade for at least 30 minutes (preferably overnight). ",
            "Freezing: Transfer the marinated tempeh to the freezer and freeze for up to 3 months. When ready to cook, place the frozen marinated tempeh into the refrigerator overnight or until completely thawed. Alternatively, place the tempeh in a bowl of hot water and change water as it cools until thawed. Now the tempeh is ready to be cooked! See this post to see how to cook tempeh. "
        ],
        "link": "https://okonomikitchen.com/5-easy-marinades-for-tempeh",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/05/vegan-tempeh-marinades-1-of-1-1024x683.jpg"
    },
    {
        "name": "Funfetti Mug Cake (Vegan + Gluten Free)",
        "servings": "1 serving",
        "ingredients": [
            "1 tbsp tahini (15g // or cashew butter)",
            "3 tbsp non-dairy milk (45ml)",
            "1 tbsp granulated sugar (12g)*",
            "1/2 tsp apple cider vinegar ",
            "1/2 tsp vanilla",
            "1/4 tsp almond extract, optional",
            "1/4 cup oat flour (30g // homemade or store bought)",
            "1/2 tsp baking powder",
            "small pinch of salt",
            "1 tbsp funfetti vegan sprinkles (10g)",
            "Coconut whip cream",
            "Dairy free ice cream",
            "Vegan funfetti sprinkles"
        ],
        "instructions": [
            "Add tahini, non dairy milk, apple cider vinegar, vanilla, almond extract, coconut sugar and salt into a microwave safe mug (or deep bowl) and stir until combined. Sift in oat flour and baking powder and stir until just combined. If it the batter seems stiff, add in 1-2 tsp more of non dairy milk until its like a muffin-like batter. Fold in the funfetti sprinkles in. ",
            "Microwave on high (1000 W) for 1 minute and then another 20-30 seconds. Let it cool for 2 minutes, top with dairy free whipped cream or ice cream and enjoy!"
        ],
        "link": "https://okonomikitchen.com/funfetti-mug-cake-vegan-+-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/05/vegan-funfetti-mug-cake-recipe-2-of-2-1024x683.jpg"
    },
    {
        "name": "Easy Blueberry Lemon Mug Cake (Vegan + Gluten Free)",
        "servings": "1 serving",
        "ingredients": [
            "1 tbsp lemon juice (15g)",
            "1 tbsp cashew butter (15g // or tahini)",
            "1.5 tbsp maple syrup (30g)",
            "2 heaping tbsp non-dairy yogurt (35g)*",
            "1 tsp lemon zest",
            "1/2 tsp vanilla extract",
            "1/4 cup oat flour (30g // homemade or store bought)",
            "1/2 tsp baking powder",
            "3 tbsp blueberries (30g)",
            "1 tbsp non dairy milk (15g // only as needed)",
            "Coconut whip cream",
            "Dairy free vanilla ice cream"
        ],
        "instructions": [
            "Add the lemon juice, cashew butter, maple syrup, non dairy yogurt, vanilla and lemon zest into a mug and stir until combined. ",
            "Add in the oat flour and baking powder and mix until just combined. If the batter looks too thick (due to thicker yogurts), stir in 1 tbsp of non dairy milk. Fold in blueberries. ",
            "Microwave on high (1000 W) for 1 minute and 30 seconds. Microwave for another 10 seconds if needed.",
            "Let it cool for 2 minutes and enjoy!",
            "Follow steps 1 & 2 above.",
            "Bake at 350 F for 10-12 minutes until cake rises and top is cooked. Check doneness by inserting toothpick and ensuring it comes out mostly clean. "
        ],
        "link": "https://okonomikitchen.com/easy-blueberry-lemon-mug-cake-vegan-+-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/05/vegan-lemon-blueberry-mug-cake-recipe-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Vegan Cinnamon Roll in a Mug",
        "servings": "1 serving",
        "ingredients": [
            "1 heaping tbsp banana puree (20g)**",
            "1/2 tsp apple cider vinegar",
            "1.5–2 tbsp non dairy milk 30g",
            "1/3 cup + 1 tbsp spelt flour (45g // plus more for dusting)*",
            "1/2 tsp baking powder",
            "1 tbsp tahini (15g // or drippy cashew butter)",
            "1 tbsp coconut sugar  (12g // or sugar of choice)",
            "1/4 tsp cinnamon ",
            "Option 1: 2 tbsp powdered sugar + 1 tsp canned coconut milk",
            "Option 2: 1 tbsp coconut butter + 1.5 tsp maple syrup "
        ],
        "instructions": [
            "Into a bowl, mash the banana. Add in the almond milk and apple cider vinegar and stir to combine. Then sift in the flour and baking powder and mix until a dough forms. ",
            "Flour working surface and hands. Remove the dough from the bowl and roll into a log and then flatten into a rectangle. ",
            "Spread tahini onto the dough and then sprinkle with coconut sugar and cinnamon. Starting from the end piece closest to you, roll the dough as tightly as possible. Carefully transfer to a mug. ",
            "Microwave on high (1000 W) for 1 minute. Add 10-15 seconds if needed. ",
            "Make glaze by mixing powdered sugar and coconut milk or coconut butter and maple syrup and drizzle on top. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-cinnamon-roll-in-a-mug",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/05/microwave-cinnamon-roll-in-a-mug-recipe-vegan-1-of-1-1024x683.jpg"
    },
    {
        "name": "Crispy Sweet and Sour Tofu",
        "servings": "4 servings",
        "ingredients": [
            "14 oz block of extra firm tofu, frozen and then thawed* (336g)",
            "1 tbsp corn starch",
            "1 cup sweet and sour sauce (250g // store bought or homemade)",
            "1 large red bell pepper, chopped  (220g)",
            "1 large green bell pepper, chopped (200g)",
            "1 large onion, chopped (180g)",
            "rice to serve "
        ],
        "instructions": [
            "Once the tofu has fully thawed, remove from the package and drain excess liquid. Then cut into 3/4 inch cubes. If you have fresh tofu that hasn’t been frozen, press for 15 minutes using a tofu press or by placing it between two clean towels and placing a heavy object on top. Then dust corn starch over the tofu until lightly coated. ",
            "\n\nAir fryer method: Air fry at 400 F for 5 minutes. Shake the air fryer basket and then air fry for another 3-4 minutes until lightly golden. \nOven method: Bake at 400F for 15 minutes. Flip the pieces of tofu and bake for another 8-10 minutes or until the edges are crispy. \n\n",
            "Air fryer method: Air fry at 400 F for 5 minutes. Shake the air fryer basket and then air fry for another 3-4 minutes until lightly golden. ",
            "Oven method: Bake at 400F for 15 minutes. Flip the pieces of tofu and bake for another 8-10 minutes or until the edges are crispy. ",
            "While the tofu is baking, chop the bell peppers and onions into 1/2-3/4 inch pieces. Prepare the sweet and sour sauce if you don’t have any on hand. ",
            "Heat a large pan or woke over high heat and fry the onions for In a large pan or wok over high heat, fry the onions for 2-3 minutes. Add in the bell peppers and cook for another 3 minutes. Add the tofu and the sweet and sour sauce and toss until everything is well coated in the sauce. Remove pan from heat and serve over rice."
        ],
        "link": "https://okonomikitchen.com/crispy-sweet-and-sour-tofu",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/05/vegan-sweet-and-sour-tofu-recipe-1-of-1-2-1024x512.jpg"
    },
    {
        "name": "Vegan Instant Pot Burrito Bowls",
        "servings": "4 servings",
        "ingredients": [
            "1/2 large onion, chopped (125g)",
            "1 bell pepper, chopped (150g)",
            "2 tbsp homemade taco seasoning (10g)",
            "1 15oz can of black beans, drained & rinsed (260g)",
            "1 10oz can of corn, drained (164g)",
            "1/4 cup diced green chiles or pickled jalapeño (28g)",
            "1 cup mild or hot salsa (265g)",
            "1 cup long grain jasmine rice (180g)",
            "1 cup water ",
            "½ cup vegan cheese, optional (56g // I used a mix of Earth Island, GoVeggie and Daiya)",
            "Lettuce, fresh tomatoes, red onions, green onions or cilantro",
            "Guacamole or avocado",
            "Vegan sour cream"
        ],
        "instructions": [
            "Set instant pot to sauté. Add onions and cook for 3 minutes. Add in the bell peppers for cook for another 2 minutes until slightly tender. Turn off the sauté setting. ",
            "Add in the black beans, corn, green chiles, salsa, rice and then water/broth. Ensure that the rice is fully submerged underwater (do not stir the rice but layer it evenly on top of the other ingredients). Press the white rice button and cook on high pressure for 10 minutes. Allow the pressure to release naturally. ",
            "Divide and serve with toppings of your choice and enjoy! "
        ],
        "link": "https://okonomikitchen.com/vegan-instant-pot-burrito-bowls",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/04/vegan-instant-pot-burrito-bowl-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Marinated Hoisin Peanut Tempeh",
        "servings": "3 servings",
        "ingredients": [
            "1 8 oz block of tempeh*",
            "1/4 cup light soy sauce (60ml // or 3 tbsp regular soy sauce + 1 tbsp water)**",
            "2 tbsp peanut butter (32g)",
            "2 tbsp maple syrup (30g)",
            "1 tbsp sesame oil (15g)",
            "1 tbsp rice vinegar (15g)",
            "1 garlic clove, minced (3g)",
            "1/8 tsp black pepper",
            "1 tsp spicy fermented bean paste (5g // use 1 tsp miso paste for non-spicy version)"
        ],
        "instructions": [
            "Cut tempeh into desired pieces. You can slice them into triangles (shown in the photo), into 3/4 inch x 3/4 inch cubes or in strips about 1/4 inch in thickness. ",
            "Optional step: if you want to get rid of the slight bitter taste tempeh has, steam the tempeh in a steamer basket for 10-12 minutes. I find the marinade masks the bitter flavour really well so usually skip this step but if you’re new to tempeh I do recommend doing it. ",
            "Add the marinade ingredients into a shallow bowl and whisk until combined. Add the tempeh and toss until they’re all evenly coated in the marinade. Let it sit for 2-3 hours (preferably overnight). ",
            "Baked Method: Pre-heat oven to 400 F. Place the tempeh on a parchment / silpat lined baking tray and arrange tempeh so they are not touching each other. Bake for 23-25 minutes, flipping them half way (at 12 minutes). ",
            "Air Fry Method: Pre-heat air fryer to 375 F. Air fry for 15 minutes, flipping them half way (at 7 minutes). ",
            "Stove Top Method: Place the tempeh into a nonstick skillet over medium high heat. Cook each side for about 4-5 minutes or until heated through and slightly browned and crispy on the outside. ",
            "Serve over rice (or grain of choice), noodles, salads, in sandwiches or enjoy straight off the pan. "
        ],
        "link": "https://okonomikitchen.com/marinated-hoisin-peanut-tempeh",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/04/marinated-baked-hoisin-peanut-tempeh-recipe-12-of-13-683x1024.jpg"
    },
    {
        "name": "Banana Bread Donuts with Whipped Coffee",
        "servings": "6 donuts",
        "ingredients": [
            "1/3 cup non dairy milk (83ml)",
            "1 tsp lemon juice",
            "2/3 cup mashed bananas (150g // about 2 small bananas)",
            "2 tbsp runny tahini (30g // or any runny nut butter of choice)",
            "1.5 tbsp maple syrup (30g)",
            "1 tsp vanilla",
            "1 tsp cinnamon, optional ",
            "3/4 cup gluten free oat flour (90g // made from blending 1 cup of rolled oats or store bought)",
            "1/3 cup gluten free rolled oats (30g)",
            "1 tsp baking powder",
            "1/2 tsp baking soda ",
            "pinch of salt",
            "3 tbsp instant coffee (18g)",
            "3 tbsp hot water (45ml)",
            "2 tbsp granulated sugar (26g // I use organic cane or coconut sugar)"
        ],
        "instructions": [
            "Mix the non dairy milk and lemon juice together in a large mixing bowl. In the meantime, pre heat the oven to 350 F, grease your donut pan, gather the rest of your ingredients and measure out the bananas. Mash the bananas in the same bowl with the non dairy milk and lemon juice mixture. Stir in the tahini, maple syrup, vanilla and cinnamon until combined.",
            "Add in the oat flour, rolled oats, baking powder, baking soda and salt. Using a spatula, mix until combined.",
            "Divide the batter into a donut pan that holds 6 servings. Bake for 15-18 minutes rotating the donut pan half way.",
            "Let it cool in the pan for 3-5 minutes and then carefully remove each donut from the pan. They should slide out easily just by running the edges with a dull knife or spoon. Let them cool on a wire rack until fully cooled. ",
            "While waiting for the donuts to cool, make the whipped coffee. Add the ingredients into a mason jar or deep mixing bowl and stir to dissolve the sugar. Once dissolved, use a electric hand held mixer to whip until stiff peaks form– it should look like whip cream! For details instructions and other methods of making it, check out my Ultimate Guide to Whipped Coffee. ",
            "Once the donuts are cooled, add whipped coffee to the donuts and serve. "
        ],
        "link": "https://okonomikitchen.com/banana-bread-donuts-with-whipped-coffee",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/04/vegan-baked-banana-bread-donuts-with-whipped-coffee-1-of-1-1024x683.jpg"
    },
    {
        "name": "How to Make Whipped Chocolate (Dalgona Chocolate) Latte + Hot Chocolate",
        "servings": "2 servings",
        "ingredients": [
            "1/3 cup aquafaba (80ml)",
            "¼ tsp cream of tartar ",
            "2 tbsp cocoa powder (10g // can also use cacao powder) ",
            "3 tbsp confectioners sugar (22g // or 2 tbsp granulated sugar)*",
            "1 tsp instant coffee + 2 tbsp hot water (or 1 shot of espresso)",
            "1 tbsp sugar (12g)",
            "1 cup ice",
            "1 cup non dairy milk, cold or heated (240ml)",
            "cocoa powder for dusting on top",
            "chocolate shavings for garnish"
        ],
        "instructions": [
            "Using a stand mix or hand held mixer, whip aquafaba in a medium to large bowl until stiff peaks form. ",
            "Sift in the cream of tar tar and continue to whip for another 1 minute. Sift in powdered sugar and whip for another minute. Lastly, sift in the cocoa powder and sift for another 2 minutes, or until soft peaks form. Use a spatula to scrape down the sides of the bowl if needed. ",
            "Add instant coffee, hot water and 1 tbsp of sugar into a cup and mix until sugar is completely dissolved. Add 1 cup of ice and then slowly pour in the non dairy milk to achieve layers of coffee and milk. If you want a warm latte, omit the ice. Top with whipped chocolate and serve. ",
            "Hot Version: Warm up 1 cup of non dairy milk and then add whipped chocolate on top. ",
            "Cold Version: Add 1 cup of ice to a glass and pour in 1 cup of milk. Then top it off with whipped chocolate. ",
            "Transfer whipped chocolate into ice cube trays or a freezer safe container. When ready, pop the whipped chocolate out of the ice cube trays (or scoop it out of the container) and add to any drink! "
        ],
        "link": "https://okonomikitchen.com/how-to-make-whipped-chocolate-dalgona-chocolate-latte-+-hot-chocolate",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/04/dalgona-chocolate-1-of-1-1024x683.jpg"
    },
    {
        "name": "Sweet Chili Coconut Tofu Bowls",
        "servings": "2 servings",
        "ingredients": [
            "1/2 a batch of crispy coconut crusted tofu",
            "1/2 cup sugar snap peas, trimmed (42g)",
            "3/4 cup fresh pineapple chunks (125g)",
            "1 small carrot, shredded or julienned (65g)",
            "1/2 cup corn (80g)",
            "1/2 cup edamame (80g)",
            "1/4 cup sweet chili sauce (60ml)",
            "2 cups rice (400g // or grain of choice for serving)",
            "lime wedges for serving"
        ],
        "instructions": [
            "Prepare batch of crispy coconut crusted tofu (not included in prep time assuming you have a batch ready). I make extra batches for meal prep and keep it in the fridge to save time. Measure, wash and prep the rest of the ingredients. ",
            "Divide the rice into two bowls. Top each bowl with equal amounts of coconut crusted tofu, sugar snap peas, pineapple, carrots, corn and edamame. Drizzle each bowl with 2 tbsp of sweet chili sauce (or more to taste) and serve with fresh lime juice. "
        ],
        "link": "https://okonomikitchen.com/sweet-chili-coconut-tofu-bowls",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/04/sweet-chili-rice-bowls-with-crispy-coconut-tofu-1-of-1-1024x683.jpg"
    },
    {
        "name": "Chocolate Green Smoothie Muffins (Vegan + Gluten Free)",
        "servings": "9 muffins",
        "ingredients": [
            "3 small overripe bananas (300g // 1.5 cups, mashed)",
            "1/4 cup drippy nut butter (62 g // I use tahini but you can also use almond butter or peanut butter)",
            "1/4 cup non dairy milk (63 ml // I use cashew milk)",
            "1/3 cup coconut sugar (70g)*",
            "2 cups spinach (60g)",
            "1 tsp vanilla",
            "1 1/4 cup gluten free rolled oats, blended into a flour (120g // or 1 cup oat flour)",
            "1/2 cup + 2 tbsp cocoa powder (62g // or cacao powder)",
            "1/2 cup almond flour (56g)",
            "2 tsp baking powder",
            "1 tsp baking soda",
            "1/4 tsp salt",
            "1/4 cup dairy free chocolate chips (40g)"
        ],
        "instructions": [
            "Preheat oven to 425 F. ",
            "Blend oatmeal to make oat flour if haven’t done already. Remove from blender. Add all the wet ingredients into the blender and blend until smoothie like consistency. If you like bits of banana chunks in your muffins, reserve 1 banana and mash in another large mixing bowl. ",
            "Pour the smoothie into the large mixing bowl. Add in the oat flour, cocoa powder, almond flour, baking powder, baking soda and salt and use a spatula to fold all ingredients together until a scoop-able batter forms. Divide batter into 9 lined or greased muffin tins. Each muffin is about 84g. Then add chocolate chips on top.",
            "Place into the oven and bake for 4 minutes. Drop the temperature down to 350 F and bake for another 19-20 minutes. Check doneness by inserting a toothpick into the centre of a muffin, it should come out almond clean or with a few crumbs on it. ",
            "Remove from the oven and let it cool in the pan for no more than 5 minutes (I usually take them out at 3 minutes or once I can touch them without burning my self). Place them onto a cooling rack and let them cool for 10 minutes before eating. "
        ],
        "link": "https://okonomikitchen.com/chocolate-green-smoothie-muffins-vegan-+-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/04/vegan-gluten-free-chocolate-banana-muffins-with-spinach-recipe-1-of-3-1024x683.jpg"
    },
    {
        "name": "Warm Chia Pudding",
        "servings": "1 serving",
        "ingredients": [
            "3 tbsp chia seeds (30g)",
            "3/4–1 cup plant based milk (188-250ml // I used cashew milk)",
            "1–2 tbsp maple syrup (20-40g // depending on how sweet you like it)",
            "1 tsp vanilla",
            "1 tbsp sesame seeds or hemp seeds, optional ",
            "1/2 tsp cinnamon, optional",
            "pinch of salt"
        ],
        "instructions": [
            "In a medium pot, add the milk and chia seeds, stir and bring to a low boil over medium-low heat.Cook for about 3-5 minutes or until it starts to thicken. ",
            "Turn off the heat and stir in maple syrup, vanilla, sesame seeds, cinnamon and pinch of salt until well combined. ",
            "Transfer into a bowl and top with your favourite toppings and enjoy!"
        ],
        "link": "https://okonomikitchen.com/warm-chia-pudding",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/03/warm-chia-seed-pudding-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Egg Roll in a Bowl",
        "servings": "2 servings",
        "ingredients": [
            "8 oz extra firm tofu or tempeh, crumbled (224g)",
            "5–6 shiitake mushrooms, rehydrated for 30 minutes in hot water ",
            "1 package mung bean glass noodles (50g)",
            "3 large carrots, shredded (150g)",
            "1 bell pepper, thinly sliced(150g)",
            "1 large head of cabbage, shredded (450g)",
            "4 scallions, chopped whites and greens separated (40g)",
            "4 garlic cloves, grated",
            "1 knob of ginger, grated ",
            "2 tbsp soy sauce (or tamari for gluten free)",
            "1 tbsp rice vinegar",
            "1 tsp salt",
            "1/2 tbsp sugar",
            "1 tbsp sesame oil",
            "1/4 tsp white pepper",
            "1/4 tsp Chinese five spice powder"
        ],
        "instructions": [
            "Place mung bean noodles in room temperature water.",
            "Cut the stems of the rehydrated shiitake mushrooms off and slice into thin strips. ",
            "Heat large frying pan or wok over medium high heat. Add 1 tbsp of oil (or water) and fry garlic, ginger, shiitake mushrooms and crumbled tofu and fry for 1 minute. Add the carrots and bell pepper and fry for another 30 seconds.",
            "Turn up the heat to high and add the cabbage and fry everything for 1 minute. Drain the mung bean noodles and use kitchen shears to cut noodles into around 1 inch lengths. Add the noodles, soy sauce, rice vinegar, salt, sugar, sesame oil, white pepper, chinese five spice powder and stir fry for another minute. Mix in the green parts of the scallions and serve. "
        ],
        "link": "https://okonomikitchen.com/vegan-egg-roll-in-a-bowl",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/03/vegan-egg-roll-bowls-1-of-1-1024x683.jpg"
    },
    {
        "name": "Crispy Roasted Sweet Potatoes",
        "servings": "2 servings",
        "ingredients": [
            "2 lbs sweet potato (around 2–3 medium sweet potatoes)",
            "1.5 tbsp olive oil or coconut oil",
            "2 tbsp corn starch",
            "2 tbsp of nutritional yeast for OR 1 tbsp coconut sugar*",
            "1/2 tsp salt ",
            "1/2 tsp paprika",
            "1/2 tsp cumin",
            "1/2 tsp onion powder",
            "1/2 tsp garlic powder",
            "1/8 tsp cayenne powder "
        ],
        "instructions": [
            "Pre-heat oven to 425 F (210 C).",
            "Peel and cube the sweet potatoes into 1/2 inch sized pieces. Transfer it to a parchment or silicon lined baking pan and toss in olive oil, corn starch, nutritional yeast (or coconut sugar for sweeter roasted sweet potatoes) and salt. Sprinkle on any seasonings if using and toss to coat. Spread out the sweet potatoes so they are not overlapping or touching each other. Bake for 30 minutes, flipping the sweet potatoes half way (around the 15 minute mark). "
        ],
        "link": "https://okonomikitchen.com/crispy-roasted-sweet-potatoes",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/02/crispy-roasted-sweet-potatoes-1-of-1-1024x683.jpg"
    },
    {
        "name": "Healthy Blueberry Oatmeal Muffins (Vegan, Gluten Free + Oil Free)",
        "servings": "6 muffins",
        "ingredients": [
            "2 flax eggs (16g // 2 tbsp flax + 5 tbsp water whisked together in a bowl set for 10 minutes)",
            "1/2 + 1 tbsp non dairy milk (140ml)",
            "2 tsp apple cider vinegar",
            "1/3 cup coconut sugar (89g)",
            "2 tsp vanilla extract",
            "1 cup oat flour (120g)",
            "1/4 cup tapioca starch (32)",
            "3/4 cup almond flour (84g)",
            "2 tsp baking powder",
            "1/2 tsp baking soda",
            "1/4 tsp salt",
            "3/4 cup blueberries (150g)"
        ],
        "instructions": [
            "Pre-heat oven to 425 F (210 C). ",
            "Add the flax meal and water into a bowl, stir and set aside. Mix together the non-dairy milk and apple cider vinegar into a large mixing bowl and let it sit for around a minute. Toss the blueberries in 1 tbsp of the corn starch and set aside (reserve a handful to the side for topping later). ",
            "Add the flax egg, coconut sugar and vanilla extract tot he large bowl with the non-dairy milk mixture and stir. ",
            "Add in the oat flour, tapioca starch, almond flour, baking powder, baking soda and salt. Use a spatula to mix all the ingredients together using a folding motion. One it is mostly mixed, fold in the dusted blueberries. Fill 6 muffin tins all the way to the top. Top with remaining blueberries.",
            "Place into the oven and bake for 5 minutes. Reduce the temperature to 350 F and bake for another 13-14 minutes, or until tooth pick comes out clean when inserted. ",
            "Remove from oven and allow it to cool for 2-3 minutes. Quickly but carefully, remove each muffin and place on a cooling rack and allow it to fully cool before eating. "
        ],
        "link": "https://okonomikitchen.com/healthy-blueberry-oatmeal-muffins-vegan,-gluten-free-+-oil-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/02/vegan-gluten-free-healthy-blueberry-oatmeal-muffins-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Banana Protein Muffins",
        "servings": "8 muffins",
        "ingredients": [
            "3 medium bananas, mashed (approx. 365g)",
            "2 tbsp coconut sugar (20g)*",
            "3–4 tbsp non-dairy milk (45ml)",
            "1 tsp vanilla, optional",
            "1 tsp cinnamon, optional",
            "1 cup + 2 tbsp gluten free flour (138g // I use half oat flour + half gluten free flour blend)",
            "2.5 scoops of neutral or vanilla vegan protein powder (75g)*",
            "1.5 tsp baking powder",
            "1 tsp baking soda"
        ],
        "instructions": [
            "Pre-heat oven to 425 F (220 C)",
            "Add mashed banana, coconut sugar, 3 tbsp non-dairy milk, vanilla and cinnamon into a large bowl and whisk until combined. Add in the flour, vegan protein powder, baking powder and baking soda. Use a spatula and mix until a thick batter forms. If the batter looks too thick, add an extra tbsp of non-dairy milk (refer to video/photos). ",
            "Divide the batter into 8 muffin tins. Bake for 5 minutes and then reduce the temperature to 350 F and bake for another 15-20 minutes or until cooked through. Check doneness by inserting a toothpick in the centre of one of the muffins, it should come out clean. ",
            "Remove from oven and let it cool in the pan for 5 minutes. Carefully transfer to a cooling rack and allow the muffins to cool for another 10 minutes before eating. "
        ],
        "link": "https://okonomikitchen.com/vegan-banana-protein-muffins",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/02/vegan-banana-protein-muffins-1-of-1-1024x683.jpg"
    },
    {
        "name": "Cashew Butter Blondies (Vegan + Gluten Free)",
        "servings": "9 servings",
        "ingredients": [
            "2/3 cup cashew butter (166g)",
            "1/2 cup coconut sugar (100g)*",
            "1 tbsp molasses (20g)",
            "1/3 cup cashew milk (83ml // can substitute any non-dairy milk)",
            "2 tsp vanilla (10ml)",
            "3/4 cup fine oat flour (90g // homemade or store bought // can use gluten free all purpose or all purpose flour)",
            "1/2 tsp baking powder (2.5g)",
            "1/4 tsp salt ",
            "1/4 cup chocolate chips for topping, optional (45g)",
            "flaky salt for topping, optional"
        ],
        "instructions": [
            "Pre-heat oven to 350 F. ",
            "Mix Wet Ingredients: Into a large bowl add in the cashew butter, coconut sugar, molasses, cashew milk and vanilla, and whisk to combine. ",
            "Mix Dry Ingredients: Add in the oat flour, baking powder and salt and mix until a batter forms. ",
            "Bake: Pour into a parchment lined 7×7 inch baking pan. Top with chocolate chips if using. Bake for 22-25 minutes, or until edges are golden brown. Let it cool in the pan for 10 minutes. Carefully remove from baking tin and cool on wire rack for an additional 10 minutes before slicing. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/cashew-butter-blondies-vegan-+-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/vegan-gluten-free-cashew-butter-blondies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Hummus Pasta Bake with Soyrizo (5-Ingredients)",
        "servings": "4 servings",
        "ingredients": [
            "7 oz gluten free pasta of choice (200g // regular or whole wheat pasta if gluten free free not needed)",
            "1 cup vegan chorizo (175g // homemade or store bought)",
            "1 1/2 cup hummus (350g // homemade or store bought)*",
            "1 cup grape tomatoes, halved",
            "2 cups spinach "
        ],
        "instructions": [
            "Pre-heat oven to 350 F (180 C)",
            "Cook pasta following instructions on package. Drain water and return to pot.",
            "Add in the chorizo and mix. Add 1 cup of hummus and mix. At this point if it looks a little sparse or dry, add in 1-2 tbsp of olive oil or 3 tbsp or non dairy milk. ",
            "Transfer pasta into a 8×8 inch glass baking dish. Spread remaining hummus on top. ",
            "Place the sliced grape tomatoes on top. Stuff spinach leaves between pasta.",
            "Bake for 20-25 minutes. Serve immediately and enjoy!"
        ],
        "link": "https://okonomikitchen.com/hummus-pasta-bake-with-soyrizo-5-ingredients",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/vegan-hummus-pasta-bake-with-soyrizo-1-of-1-1024x683.jpg"
    },
    {
        "name": "Golden Curry Lentil and Quinoa Soup",
        "servings": "4 servings",
        "ingredients": [
            "1 onion, diced (110g)",
            "3 garlic cloves minced (9g)",
            "2 tbsp minced ginger (30g)",
            "1.5 tbsp curry powder (22g)",
            "2 tsp salt",
            "1/2 tsp red pepper flakes, optional",
            "¾ cup dry red lentils (156g)",
            "¼ cup dry quinoa (42g)",
            "1 tbsp soy sauce (15g // tamari for gluten free)",
            "3 + 1/2 cups vegetable broth (875ml)",
            "1 cup full fat coconut milk (250ml)",
            "1 cups frozen vegetables (160g)"
        ],
        "instructions": [
            "Add onions and garlic into a large pot over medium high heat and cook for 1 minute. Add ginger, curry paste, red pepper flakes and salt. Cook for another minute, stirring frequently. ",
            "Add in 3 cups of vegetable broth, soy sauce, quinoa and red lentils. Bring the vegetable broth to a boil. Cover with  a lid and reduce the heat to low. Let it simmer for around 20 minutes or until lentils and quinoa have absorbed all the liquid and is cooked. ",
            "Give it a stir and then pour in the coconut milk, peas and left over 1/2 cup vegetable broth (or more) until desired consistency. Taste and adjust with more salt and seasonings as desired. ",
            "Portion soup into bowls and top with cilantro, coconut flakes and red pepper flakes as desired. Serve and enjoy! "
        ],
        "link": "https://okonomikitchen.com/golden-curry-lentil-and-quinoa-soup",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/vegan-golden-curry-lentil-and-quinoa-soup-1-of-1-1024x683.jpg"
    },
    {
        "name": "Date Sweetened Peanut Butter Cookies",
        "servings": "8 cookies",
        "ingredients": [
            "2/3 cup soft dates, pitted (120g // I like to use Khadrawy dates)",
            "3 tbsp non-dairy milk (45g)",
            "1/3 cup peanut butter (65g)",
            "½ tsp salt, optional",
            "1 tsp vanilla, optional",
            "2/3 cup gluten free rolled oats, blended into flour (80g // or 1/2 cup + 2 tbsp oat flour)",
            "1 tsp baking powder",
            "melted dark chocolate (for garnish), optional",
            "flaky sea salt (for garnish), optional "
        ],
        "instructions": [
            "Pre-heat oven to 350 F (180 C)",
            "Add dates, non-dairy milk, peanut butter, salt and vanilla into a food processor and blend until smooth.",
            "Add in the blended oats and baking powder and blend until a dough forms. Scrape down the sides of the food processor as needed. ",
            "Scoop out 1 heaping tbsp (around 40g per each) and roll them into balls. Flatten them with a back of the fork. Bake for 15 minutes."
        ],
        "link": "https://okonomikitchen.com/date-sweetened-peanut-butter-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/date-sweetened-vegan-peanut-butter-cookies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Japanese Curry Fried Rice",
        "servings": "2 servings",
        "ingredients": [
            "3 tbsp soy mince, rehydrated (20g dry)",
            "1/4 medium onion, diced (42g)",
            "1 tbsp soy sauce",
            "1/2 tsp salt",
            "1/2 tsp pepper",
            "1/3 cup mixed vegetable (50g)",
            "1/4 cup raisin (32g)",
            "2 cups cooked white rice (400g // preferably day old)*",
            "1 Japanese Curry Sauce Mix Cube, chopped (18g)*"
        ],
        "instructions": [
            "Heat 1 tbsp of oil in a large wok or skillet over medium high heat. Add soy mince, onions, soy sauce, salt and pepper and cook until the onions are browning (2 minutes).",
            "Add in the frozen mixed vegetables and raisins and cook until warmed through (2 minutes).",
            "Add in the rice and use a wooden paddle to “cut” through the rice without mashing it until the rice scattered. ",
            "Spread the chopped curry sauce mix on top of the rice and carefully mix. The curry mix should begin to melt and become aromatic. Taste and add more salt or pepper as needed. Once all the rice is coated in the curry mix, remove from heat and serve between two bowls. Garnish with fresh or dried parsley. "
        ],
        "link": "https://okonomikitchen.com/japanese-curry-fried-rice",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/vegan-japanese-curry-fried-rice-1-of-1-1024x683.jpg"
    },
    {
        "name": "Authentic Vegan Miso Soup",
        "servings": "2 servings",
        "ingredients": [
            "2 cups water (500ml)",
            "1 tsp kombu dashi* (5g)",
            "2 tbsp miso paste (40g)",
            "1/4 daikon, chopped into match sticks (200g)",
            "1 scallion, sliced (10g)",
            "1/2 tbsp dried sea weed/wakame (2g)",
            "1 cups water (500ml)",
            "1 1/4 tsp kombu dashi (5g)",
            "2.5 tbsp miso paste (50g)",
            "1/2 block soft tofu, cubed (80g)",
            "1 scallion, sliced (10g)",
            "2 cups water (500ml)",
            "1 tsp kombu dashi (5g)",
            "2 tbsp miso paste (40g)",
            "2 cups spinach (50g)",
            "1 scallion, sliced (10g)"
        ],
        "instructions": [
            "Add water and dashi to a medium pot over medium heat. Add the daikon and simmer until tender. Turn off the heat. Add miso paste to a small sieve over the pot and stir using a spoon until miso is dissolved. ",
            "Divide into two bowls and garnish with green onions. ",
            "Rehydrate wakame in room temperature water for 5 minutes. Drain and squeeze any excess water out. Set aside. ",
            "Over medium heat, add water and dashi to a medium pot. Once the broth starts to simmer, turn heat to low. Add miso paste into sieve over the soup and dissolve miso paste. Add the tofu and wakame and stir. Keep on the stove until the soup and tofu is heated (be sure not to let it boil). ",
            "Divide into two bowls and garnish with green onions. ",
            "Bring a pot of water to a boil. Add in the spinach and cook for 20 seconds. Drain and rinse with cold water. Squeeze out any excess liquid (this should form a ball of spinach). Chop the ball of spinach into thirds. ",
            "Over medium heat, add water and dashi to a medium pot. Once the broth starts to simmer, turn heat to low. Add miso paste into sieve over the soup and dissolve miso paste.",
            "Add in the cooked spinach and let it heat for another minute.",
            "Serve and garnish with green onions. "
        ],
        "link": "https://okonomikitchen.com/authentic-vegan-miso-soup",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/vegan-miso-soup-9-of-13-1024x683.jpg"
    },
    {
        "name": "Vegan Caramel Black Bean Brownies",
        "servings": "9 Servings",
        "ingredients": [
            "2 tbsp ground flax meal + 6 tbsp water (18g)",
            "1.5 cup black beans (258g // 1 15oz can black beans rinsed and drained)",
            "1/3 cup peanut butter (83g)",
            "1/3 cup cocoa powder (50g)",
            "½ cup coconut sugar (90g)",
            "1 tsp vanilla (5g) ",
            "¼ tsp baking soda (1g)",
            "1/2 tsp salt",
            "1/2 cup dark chocolate, chopped (75g)",
            "3–4 tbsp Nature’s Charm Caramel Sauce (45g)",
            "flaky salt for topping, optional "
        ],
        "instructions": [
            "Pre-heat oven to 350 F (180 C). Line 6×6 inch baking tin or grease with oil. ",
            "Add all the ingredient except the dark chocolate into a food processor and blend until combined ans smooth. Scrape down the sides of the food processor as needed. ",
            "Add in the chopped chocolate and pulse blend a couple times to incorporate the chocolate into the batter. ",
            "Transfer brownie batter into baking pan. Using a spatula, smooth out the top. ",
            "Spoon some caramel sauce on top of the brownie. Spread or swirl the caramel over the top. ",
            "Bake for 30 minutes. Allow it to cool for 15 minutes before removing from baking pan. Place on cooling rack and cut into sliced when completely cooled."
        ],
        "link": "https://okonomikitchen.com/vegan-caramel-black-bean-brownies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2020/01/easy-vegan-black-bean-brownies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Macarons",
        "servings": "20 macarons",
        "ingredients": [
            "70g almond flour ",
            "80 icing sugar ",
            "55g aquafaba (reduced from 125g of canned chickpea water) ",
            "1/8 tsp cream of tartar",
            "20 g caster sugar",
            "1/16 tsp vegan gel paste, optional",
            "1 cup cashews, soaked (150g)",
            "½ vanilla bean (1g)",
            "¼ cup maple syrup (80g)",
            "3 tbsp coconut cream (45g)",
            "1 tbsp lemon juice (15g)",
            "pinch of salt"
        ],
        "instructions": [
            "To reduce chickpea water/aquafaba: add the aquafaba into a small saucepan over medium heat. Let it gently simmer for 15 minutes until you get 55g. It should look much thicker than when you first opened the can. ",
            "Into a bowl, whisk together almond meal and icing sugar. Set aside.",
            "In a bowl, add aquafaba and cream of tartar. Use a hand mixer and whisk on high until it starts to form foam/light peaks (3 minutes). Add in the castor sugar and continue to mix until peaks form. Add in a drop of gel if using and mix. ",
            "Using a spatula, fold in the almond flour and sugar mix until combined. Using the back of the spatula, press the mixture on the side of the bowl as you fold it in. It should start to look shiny and have a ribbons like consistency when ready. ",
            "Transfer the mixture into a piping bag with a round tip. On a parchment lined baking tray, pipe the filling into circles. ",
            "Drop the baking tray onto your kitchen counter 4-5 times. If you see any additional air bubbles, use a toothpick to pop them out.",
            "Let the mixture dry for 1.5 hours pr until the top is dry to the touch. ",
            "Preheat oven to 230 F (110 C) with fan on. Bake for 15 minutes. Allow them to cool in the oven (with door open) for 15 minutes. Remove from the oven and let them cool at room temperature for another 15 minutes before removing them from the parchment paper. ",
            "While waiting for the macaron shells to dry or cool make the cashew buttercream filling by adding all the ingredients into a high speed blender until smooth and creamy. ",
            "Once macaron shells are cooled and ready, pipe one macaron shell with vegan cashew buttercream.  Then place another macaron shell to sandwich together. "
        ],
        "link": "https://okonomikitchen.com/vegan-macarons",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-french-macaron-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Flourless Chocolate Rum Cake (Vegan)",
        "servings": "10 Servings",
        "ingredients": [
            "1/4 cup hazelnut butter (60g)",
            "1/2 cup coconut sugar (100g)",
            "5 tbsp cocoa powder (25g)",
            "1 10oz package of soft tofu, room temperature (280g)",
            "1/4 cup rum, room temperature (60ml // substitute black coffee for non-alcoholic cake) ",
            "6.5 oz high quality dark chocolate, melted (182g)",
            "1/2 tsp salt (2.5g)",
            "1 1/3 cup hazelnut meal (150g // or almond meal)",
            "2 tbsp tapioca starch (16g)",
            "1 tsp baking powder (5g)"
        ],
        "instructions": [
            "Pre-heat oven to 350 F (180 C). Line or grease a 8×8 inch spring form pan with parchment paper. ",
            "Into a food processor, add in the hazelnut butter, coconut sugar, cocoa powder, soft tofu and rum. Blend until smooth.",
            "Add in the melted dark chocolate and blend until smooth, scrapping down the sides as needed. ",
            "Add in the hazelnut meal, tapioca starch and baking powder. Blend until combined and a uniform thick batter forms. ",
            "Quickly transfer the batter into the spring form pan and smooth out the tops. Be sure to work quickly as the chocolate will begin to firm up.",
            "Bake in the oven for 38-40 minutes. Let it cool on the counter until room temperature. Then place in the refrigerator for at least 6 hours- preferably overnight. Dust with cocoa powder and serve alone or with coconut whip cream. "
        ],
        "link": "https://okonomikitchen.com/flourless-chocolate-rum-cake-vegan",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-flourless-chocolate-rum-cake-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Cheesy Cauliflower Casserole",
        "servings": "8 Servings",
        "ingredients": [
            "1 large head of cauliflower, chopped into bite sized pieces (approx. 1000g) ",
            "4 oz button or cremini mushrooms, sliced (112g)",
            "1 large onion, sliced (240g)",
            "1 cup cashews (150g)",
            "2 cups cashew milk (500ml)",
            "3 tbsp lemon juice (45g)",
            "4 large garlic cloves (12g)",
            "1 tbsp miso paste (20g)",
            "1 tsp mustard powder",
            "1/3 cup nutritional yeast (40g)",
            "¼ cup tapioca starch (30g)",
            "1 tsp salt",
            "1 cup vegan shredded cheese",
            "1/2 cup bread crumb topping (mix together):\n\n½ cup bread crumbs (54g // gluten free as needed) \n2 tbsp nutritional yeast (16g)\n¼ tsp garlic powder\n½ tsp onion powder\n½ tsp salt\n½ tsp black pepper\n\n",
            "½ cup bread crumbs (54g // gluten free as needed) ",
            "2 tbsp nutritional yeast (16g)",
            "¼ tsp garlic powder",
            "½ tsp onion powder",
            "½ tsp salt",
            "½ tsp black pepper"
        ],
        "instructions": [
            "Preheat oven to 400 F (180 C). ",
            "Add chopped cauliflower into a large pot with a steamer basket. Steam for 10-12 minutes or until just fork tender.",
            "Add sliced onions and mushrooms into a medium pan and fry until lightly browned over medium high (around 5 minutes). Place into another bowl and set aside. ",
            "Add all cheese ingredients into a high speed blender and blend until smooth. Pour the cheese sauce into the same pan used for the onions and mushroom and place over medium high heat. Stir continuously for 5 minutes until the cheese sauce becomes thick. Remove from heat.",
            "Pour half of the cheese sauce into a 9×13 inch or two 8×8 inch baking dishes. Add in the cauliflower, onions and mushrooms. Pour the rest of the cheese sauce on top and stir to make sure all the vegetables are covered with the cheese. ",
            "Top with vegan cheese or mix the bread crumb mixture. Bake in the oven for 25-30 minutes until bubbly. If you want to lightly brown the bread crumbs, broil for 1-2 minutes. Garnish with red pepper flakes and/or green onions and serve! "
        ],
        "link": "https://okonomikitchen.com/vegan-cheesy-cauliflower-casserole",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-cheese-cauliflower-casserole-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Broccoli Salad with Creamy Dressing",
        "servings": "6 servings",
        "ingredients": [
            "3/4 cup cashews, soaked in hot water for 20 minutes* (112g)",
            "4–5 tbsp water (60-75g)",
            "2 tbsp lemon juice (30g)",
            "1.5 tbsp maple syrup (30g)",
            "1 tsp dijon mustard (5g)",
            "1 large garlic clove (5g)",
            "1 tsp onion powder (2g)",
            "1 tsp salt (6g)",
            "1/2 tsp pepper (3g)",
            "Optional add-ins: 1/2 tsp paprika, 1/2 tsp dried dill, 1 tsp dried parsley ",
            "5 cups broccoli, chopped into bite sized pieces (1lb // 455g // 1 large crown)  ",
            "½ red onion, thinly sliced and soaked in water for 10 minutes (55g)",
            "1 medium apple, chopped (170g)",
            "½ cup dried cranberries (60g)",
            "1/2 cup candied walnuts (80g // store bought or homemade*)",
            "½ cup vegan bacon, optional (60g)"
        ],
        "instructions": [
            "Add all the dressing ingredients into a high speed blender, starting with 4 tbsp of water. Blend until smooth. Add extra tbsp of water if it looks or tastes too thick. Set dressing aside.",
            "Drain onions from the water. Into a large bowl combine the broccoli, onions, apples and cranberries. Give it rough toss. Pour in the sauce and toss until all pieces are coated evenly. If serving later, cover the salad and place in refrigerator. Add in the vegan bacon and candied walnuts before serving. "
        ],
        "link": "https://okonomikitchen.com/vegan-broccoli-salad-with-creamy-dressing",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-broccoli-salad-with-creamy-dressing-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Browned Coconut Butter Pecan Cookies",
        "servings": "14 cookies",
        "ingredients": [
            "1/2 cup browned coconut butter, pourable state (120g)",
            "1/3 cup maple syrup, room temperature (80g)",
            "1/4 cup dairy free milk, room temperature (60ml)",
            "1/4 cup coconut sugar (48g)",
            "2 tsp vanilla",
            "1 1/2 cup all purpose gluten free flour (180g)",
            "3 tbsp tapioca starch (22g)",
            "3/4 tsp baking powder",
            "1/4 tsp salt",
            "1/2 heaping cup pecans, divided (70g)",
            "Fancy salt, optional"
        ],
        "instructions": [
            "Pre heat oven to 350 F (180 C)",
            "Chop half of the pecans to fold into the batter and reserve the other half to press onto the top of the cookies at the end. ",
            "Into a large bowl, pour in the coconut butter, maple syrup, non dairy milk, coconut sugar and vanilla and stir until combined. ",
            "Then add in the oat flour, tapioca starch, baking powder and salt and mix until a dough forms. Fold in the chopped pecans. ",
            "Using a cookie scoop or food scale, measure out 14 portions (around 40g each) and roll them into balls. Place them onto a lined baking tray leaving at least 1 inch of space between each cookie dough. Then press in the remaining pecans on top. ",
            "Bake in the oven for 8 minutes, take them out and then let set on the hot baking tray for 10 minutes.  DO NOT over bake as they will come out dry. Transfer to a cooling rack and enjoy!",
            "Store leftovers in a airtight container at room temperature for up to 4 days. Freeze baked cookies for up to 1 month. "
        ],
        "link": "https://okonomikitchen.com/browned-coconut-butter-pecan-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-browned-coconut-butter-maple-pecan-cookies-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Flourless Peppermint Hot Chocolate Cookies (Vegan)",
        "servings": "16 cookies",
        "ingredients": [
            "1 cup almond butter (250g // I used homemade chocolate almond butter but any runny nut butter will work)",
            "½ cup aquafaba (120g // brine from unsalted canned chickpeas)",
            "½ cup coconut sugar (100g)",
            "1 tsp vanilla extract ",
            "1/2 tsp peppermint extract, optional for stronger peppermint flavour ",
            "1/3 cup cocoa powder (40g)",
            "2 tbsp oat flour (30g)",
            "1/2 tsp baking soda (2.5g)",
            "¼ tsp salt",
            "1/3 cup vegan marshmallows (40g)",
            "1/3 cup mint dark chocolate, chopped (60g) "
        ],
        "instructions": [
            "Pre-heat oven to 350 F (180 C).",
            "Into a mixing bowl add in the almond butter, aquafaba, coconut sugar, vanilla and peppermint extract (if using), and stir until combined. ",
            "Add in the cocoa powder, oat flour, baking soda and salt, and mix to combine.",
            "Fold in the vegan marshmallows and chopped dark chocolate. ",
            "Using a medium cookie scooper, portion 16 cookies (around 40g each), roll them into balls and flatten them slightly with the palm of your hand or fingers. Bake in the oven for 10-12 minutes rotating the tray half way. Let them cool on the baking tray for 5 minutes, then transfer to a wire rack to and cool completely before eating. ",
            "Store leftovers in an airtight container for 4-5 days at room temperature or freeze for up to 1 month. "
        ],
        "link": "https://okonomikitchen.com/flourless-peppermint-hot-chocolate-cookies-vegan",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-hot-chocolate-brownie-cookie-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "The Best Vegan Chocolate Chip Cookies",
        "servings": "16 cookies",
        "ingredients": [
            "1/2 cup organic granulated cane sugar (100g)*",
            "1/2 cup organic brown sugar  (110g)*",
            "1/2 cup coconut oil, melted (112g)*",
            "1/4 cup + 2 tbsp coconut milk / aquafaba or a combination of both, room temperature (90ml)*",
            "2 tsp vanilla (10g)",
            "2 1/4 cup all purpose  flour (270g // gluten free all purpose mix if needed)",
            "1 tsp baking soda (5g)",
            "1/2 tsp salt",
            "1 cup chocolate chunks/chips (120g)",
            "fancy sea salt "
        ],
        "instructions": [
            "In a large mixing bowl, whisk together the cane sugar, brown sugar, melted coconut oil, aquafaba/coconut milk and vanilla until combined.",
            "Sift in the all purpose flour and baking soda and add in the salt. Mix the dry ingredients into the wet using a folding motion with a large spatula. This helps with not over mixing. Mix until the batter looks almost fully uniform. ",
            "Fold in the chocolate chips. until evenly dispersed throughout the batter. This also finished off mixing the batter. ",
            "Cover the bowl with a lid or wrap and place into the fridge to chill for 30 minutes.",
            "Pre-heat oven to 350 F (180 C)*",
            "Using a medium cookie scoop, portion out the dough into equal sized balls (around 50g each) and roll into a tall ball (refer to photos). ",
            "Place the cookie dough on a lined baking tray leaving 2 inches between each cookie and bake for 10-13 minutes, or until there are golden brown spots. ",
            "Let them cool on the baking tray for 5 minutes. Then transfer onto a wire rack to let them cool completely before eating. "
        ],
        "link": "https://okonomikitchen.com/the-best-vegan-chocolate-chip-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/the-best-vegan-chocoalte-chip-cookies-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Vegan Baked Eggnog Cheesecake",
        "servings": "8 servings",
        "ingredients": [
            "1 1/4 cup pecans (or nuts of choice)",
            "1/4 gluten free rolled oats",
            "2 tbsp almond butter",
            "6 dates",
            "3/4 tsp cinnamon, optional ",
            "1 cup store bought vegan eggnog (240ml)*",
            "1/4 cup lemon juice (60ml)",
            "1 19 oz package extra firm tofu (532g)*",
            "1 cup cashews, soaked in hot water for 15 minutes (120g)",
            "1 cup coconut OR cane sugar (200g)*",
            "1 tbsp vanilla ",
            "3 tbsp arrowroot starch",
            "OPTIONAL: 3/4 tsp nutmeg, 2 tsp nutritional yeast, 1/2 tbsp miso paste"
        ],
        "instructions": [
            "Preheat oven to 350 F (180 C). Line a 9 inch springform pan with parchment paper or spray with oil. ",
            "Into a food processor, add in the nuts and oats and process until grounded. Then add in almond butter and dates and blend until a dough forms. Press the dough into the springform form. Use the back of a measuring cup or a flat potato masher to press flat. ",
            "Bake in the oven for 10 minutes. Reduce temperature to 325 F (160 C). ",
            "In the meantime, add all the filling ingredients into a high speed blender. Taste and add more spices and sugar to taste. Pour the filling into the springform and then bake in the oven for 40-45 minutes. ",
            "Let it rest at room temperature until cool (around 20 minutes). Then place into the refrigerator to cool for at least 4 hours- preferably overnight. ",
            "Carefully remove the cheesecake from the springform pan. The parchment paper should make removing it easy but if there are any sides of the cheesecake stuck to the springform, use a thin knife to cut between the pan and the cheesecake. ",
            "Serve with coconut whip cream or caramel sauce and enjoy!",
            "Store any leftovers in the refrigerator, covered for 3-4 days. "
        ],
        "link": "https://okonomikitchen.com/vegan-baked-eggnog-cheesecake",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-eggnog-cheesecake-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Ginger Molasses Cookies",
        "servings": "18 cookies",
        "ingredients": [
            "3/4 cup sunflower butter (192g)",
            "1/2 cup coconut sugar (96g)",
            "3 tbsp molasses (60g)",
            "3 tbsp aquafaba  (liquid of unsalted canned chickpeas // 45g)",
            "1 cup oat flour (120g)*",
            "1 tsp baking soda (5g)",
            "1–2 tsp ground ginger (depending on how gingery you like it)",
            "1 tsp cinnamon",
            "1/2 tsp cloves",
            "1/4 tsp all spice",
            "1/2 tsp salt ",
            "2 tbsp cane sugar, optional"
        ],
        "instructions": [
            "Pre-heat oven to 350 F (180 C)",
            "Into a large bowl add in the sunflower butter, coconut sugar and molasses, and mixed until combined. Then add in the aquafaba and vanilla and stir to combine.",
            "Add in the oat flour, baking soda, ginger, cinnamon, cloves, all spice and salt and mix until combined. ",
            "Measure out the dough using a medium sized cookie scooper (or weigh out 30g) and roll into a tall ball. If the dough if very sticky, place in the fridge for 15-20 minutes until firmed up**. Do not add in more flour. As an optional step, coat the pieces of dough in cane sugar and then place on baking tray. ",
            "Bake for 4 minutes. Quickly rotate the tray and bake for another 5-6 minutes or until the top starts to slightly crack. ",
            "Remove from the oven and allow them to cool for 4-5 minutes. Transfer onto a cooling wire rack and let them cool for another 5 minutes. Enjoy!",
            "Once fully cooled, store leftovers at room temperature in a covered air tight container for 3-4 days or in the freezer for up to 1 month. "
        ],
        "link": "https://okonomikitchen.com/vegan-ginger-molasses-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/12/vegan-ginger-molasses-cookies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Bombay Potatoes",
        "servings": "4 Servings",
        "ingredients": [
            "1 medium onion, diced (140g)",
            "3 garlic cloves, minced",
            "1 tbsp fresh ginger, minced",
            "3 potatoes, cubed into dice sized pieces (450g)",
            "1 19 oz can chickpeas (350g drained & rinsed)",
            "1 19 oz can crushed tomatoes (532g)",
            "2 cups vegetable broth (480 ml)",
            "1 tbsp indian curry powder",
            "2 tsp thyme",
            "1.5 tsp coriander",
            "1.5 tsp cumin",
            "1 tsp chili powder",
            "½ tsp cardamom",
            "½ tsp tumeric",
            "½ tsp nutmeg",
            "½ tsp all spice",
            "½ tsp black pepper",
            "1 tsp salt + more to taste",
            "Cooked rice",
            "Bread",
            "Cilantro, for garnish"
        ],
        "instructions": [
            "Add chopped onions, garlic and ginger into a large shallow pot over medium high heat and sautee until onions are translucent (3 minutes). ",
            "Add all the spices and fry for another 1 minutes, until fragrant. ",
            "Add the potatoes and stir to coat them in the spices. If the potatoes and/or spices start sticking to the bottom, add some water a little bit at a time. Then add in the chickpeas, crushed tomatoes and vegetable broth. Once it starts to come to a strong simmer, bring the heat down to a medium and allow it to simmer for 15 minutes, uncovered until the potatoes are cooked through and the sauce becomes thick.",
            "Serve hot with some rice and/or bread and garnish with cilantro!"
        ],
        "link": "https://okonomikitchen.com/vegan-bombay-potatoes",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/vegan-bombay-potatoes-with-chickpeas-1024x683.jpg"
    },
    {
        "name": "Vegan Pesto Ricotta Stuffed Shells",
        "servings": "4 Servings",
        "ingredients": [
            "1 batch of Vegan Tofu Ricotta (or your choice of plant based ricotta)",
            "2 handfuls of basil (Italian or Thai for a twist)",
            "3 tbsp pine nuts ",
            "25 jumbo shells (a total of 20 should be used, 5 extra just incase the shells break)",
            "2 1/2 cups marinara sauce (625ml // 1 22oz jar)"
        ],
        "instructions": [
            "Cook the pasta in salted water following the instructions until al dente (be sure not to overcook!). ",
            "While the pasta is cooking, into a food processor make the pesto ricotta by adding all of the ingredients into a good processor until combined and smooth. ",
            "Once the pasta is done cooking, rinse with cold water to stop the cooking process.",
            "Preheat oven to 350 F (180 C). ",
            "Pour all the marinara into a 9×10 inch baking dish (or divide the marinara if using 2 8×8 inch baking dishes). Alternatively, you can save some to top your shells but just be sure to cover your baking dishes with marinara.",
            "Stuff about 1 heaping tbsp of the pesto tofu ricotta into the shells and place in baking dish. If you reserved some marinara, pour it on top. ",
            "Cover the baking pans with foil and bake for 10 minutes. Remove the foil, rotate the tray and bake for an additional 15 minutes.",
            "Serve hot and garnish with fresh basil, vegan cheese or some vegan parmesan. "
        ],
        "link": "https://okonomikitchen.com/vegan-pesto-ricotta-stuffed-shells",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/vegan-pesto-ricotta-stuffed-shells-1-of-1-4-1024x683.jpg"
    },
    {
        "name": "Vegan Tofu Ricotta",
        "servings": "1.5 cups",
        "ingredients": [
            "1 14 oz block extra firm tofu, pressed for 10–15 minutes",
            "1/2 cup white beans (120g)",
            "3 tbsp nutritional yeast ",
            "1/2 lemon, juiced (25g)",
            "1 tbsp miso paste (20g)",
            "2 tbsp tahini (32g)",
            "4 large garlic cloves garlic cloves (12g // roasted or raw)",
            "1 tsp salt"
        ],
        "instructions": [
            "Into a food processor, add in the white beans and blend until mostly smooth. Then add in the tofu, nutritional yeast, lemon juice, miso paste, tahini, garlic cloves and salt. Blend until it comes together and resembles the consistency of ricotta. It should be smooth but not completely pureed. "
        ],
        "link": "https://okonomikitchen.com/vegan-tofu-ricotta",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/vegan-tofu-ricotta-cheese-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Kabocha Sweet Potato Casserole",
        "servings": "9 Servings",
        "ingredients": [
            "2 large sweet potato sweet potato (500g)",
            "1 small kabocha squash (850g // can also use butternut or hokkaido squash)",
            "1/2 cup cashew milk (120ml // or any other dairy free milk)",
            "3 tbsp arrowroot starch (24g)",
            "1–2 tbsp maple syrup, optional",
            "1 1/4 tsp cinnamon",
            "3/4 tsp nutmeg",
            "1.5 tsp vanilla",
            "1/2 tsp salt, to taste",
            "3/4 cup pecans (80g)",
            "1/2 cup gluten free rolled oats (40g)",
            "1/3 cup almond meal (37g // or oat flour) ",
            "2 tbsp maple syrup (40g)",
            "3 tbsp almond butter (45g)",
            "1/2 tsp cinnamon",
            "1/4 tsp salt",
            "2 tbsp coconut sugar (24g)"
        ],
        "instructions": [
            "Roast Sweet Potatoes & Kabocha: Preheat oven to 400 F (200 C). Line a large baking tray (or 2 small baking trays) with parchment paper. Scrub and wash the sweet potato and kabocha. Using a sharp knife, cut the kabocha into eights. Cut the sweet potato in half lengthwise and place them all on to the baking tray. Bake for 30 minutes, or until fork tender.  ",
            "Make the Pecan Crumble: While the sweet potatoes and kabocha is baking in the oven, prepare the crumble topping by combining the chopped pecans, oats, almond meal, maple syrup, almond butter, salt and cinnamon into a bowl. Mix to combine. Then add in the coconut sugar and gently mix to combine. ",
            "Make the “egg”: In a small bowl whisk together the coconut milk and arrowroot starch and let it sit. ",
            "Reduce Oven Temperature: Once the sweet potatoes and kabocha is done baking, reduce the oven temperature to 350F / 180 C.",
            "Make the Mash: Into a food processor add in the flesh of the sweet potato by scraping the insides out with a spoon. Then add in the flesh of the kabocha by either peeling the skin off with a knife or using the same scraping method with a spoon. Add in the arrowroot starch coconut milk mixture, maple syrup (if using), cinnamon, nutmeg, vanilla and salt. Puree until smooth and creamy. Taste and add more spices, maple syrup and/or salt as needed.",
            "Assemble & Bake: Transfer the mash into a 9×9 or 9×18 inch glass baking dish and spread evenly. Top with the pecan crumble and bake in the oven for 30 minutes. Let it sit for 10 minutes before serving and enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-kabocha-sweet-potato-casserole",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/kabocha-squash-sweet-potato-casserole-1-of-1-3-1024x683.jpg"
    },
    {
        "name": "Miso Glazed Roasted Root Vegetables",
        "servings": "4 servings",
        "ingredients": [
            "3 lbs of root vegetables (1350g // I used a mix sweet potatoes, potatoes and carrots)",
            "1 large red onion (250g) ",
            "1 head of garlic",
            "1/2 tsp salt",
            "1/2 tsp pepper ",
            "2 tbsp miso paste",
            "2 tbsp rice vinegar",
            "1 tbsp tahini",
            "1 tbsp maple syrup",
            "1 garlic, minced",
            "1–2 tbsp water "
        ],
        "instructions": [
            "Rinse and peel the skin off the root vegetables. Cut them into chunks that are roughly the same size (around 1-1.5 inches).* Cut the onion into wedges. Peel the skin off the garlic. ",
            "Over medium high heat add 1 cup of water into a large pot and place a steamer basket inside. Add the chopped root vegetables EXCEPT the onion and garlic into the steamer basket. Once the water starts to boil, cover and steam the vegetables for 8-10 minutes, or until they are fork tender. You should be able to pierce the vegetables with a fork but they should not be over-cooked and mushy. ",
            "Pre-heat oven to 400F. Place the steam root vegetables, onions and garlic onto a parchment lined baking tray. Sprinkle on salt and pepper and toss to season. Bake in the oven for 30-35 minutes, or until vegetables are golden brown.",
            "In the meantime, whisk together the miso paste, rice vinegar, tahini, maple, minced garlic and water. Taste and add more rice vinegar and/or water as needed. It shouldn’t be too thick, slightly runny but not water-y. ",
            "Once the vegetables are out of the oven, pour the miso glaze on top and toss to coat. Top with scallions and sesame seeds. Serve and enjoy!"
        ],
        "link": "https://okonomikitchen.com/miso-glazed-roasted-root-vegetables",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/miso-roasted-goot-vegetable-2-of-2-1024x683.jpg"
    },
    {
        "name": "Vegan Hot and Sour Soup",
        "servings": "6 servings",
        "ingredients": [
            "10 dried shiitake mushrooms, rehydrated (60g dry weight or 120g fresh)",
            "1/2 cup dried wood ear mushrooms, rehydrated (14g dry weight)",
            "1 14 oz extra firm tofu (350g)",
            "8 cups vegetable broth",
            "3 scallions sliced, white and greens separated",
            "1 tbsp grated ginger",
            "1 4oz can water chestnuts (112g)",
            "6 oz bamboo shoots (168g)",
            "1.5 tbsp dark soy sauce",
            "1 tbsp light soy sauce",
            "1 tbsp asian chili bean paste, optional",
            "1 tsp sugar",
            "1 tsp salt",
            "5 tbsp corn starch",
            "5 tbsp water",
            " ½ tbsp sesame oil",
            "1/4 cup rice vinegar",
            "1 tsp white pepper",
            "Cilantro for garnish, optional"
        ],
        "instructions": [
            "Place the dried mushrooms into a deep bowl and cover with hot water for 15 minute, or until rehydrated (they should double in size and be soft to the touch). Once rehydrated, slice the mushrooms into thin strips. ",
            "Press excess liquid out of the extra firm tofu either with a tofu press or by wrapping it in lint free kitchen towels and placing a flat heavy object on top for around 10 minutes. While waiting for these two steps, gather the rest of the ingredients. Cut the tofu into 1/2 inch cubes. ",
            "Into a large pot, add in the broth, grated ginger and white part of the scallions over medium high heat.  ",
            "Add in the mushrooms, tofu, water chestnuts, bamboo shoots, soy sauce and sugar. Once it comes to a boil, reduce the heat down to a medium low and cover. Let it simmer for 8-10 minutes to let the flavours come together. ",
            "Mix together the corn starch and water to make slurry, ensuring there are no lumps. While stirring, slowly pour in the corn starch slurry. Continue to stir to thicken the soup (1-2 minutes) ",
            "Remove the pot from the stove and add in the green onions, chili bean paste (if using) vinegar, white pepper and sesame oil. Taste and add more rice vinegar, salt and pepper to taste. ",
            "Serve immediately and garnish with cilantro. "
        ],
        "link": "https://okonomikitchen.com/vegan-hot-and-sour-soup",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/vegan-hot-and-sour-soup-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Salted Date Caramel Sauce",
        "servings": "24 Servings",
        "ingredients": [
            "1/3 cup coconut milk (80ml)",
            "¼ cup brown rice syrup (80g // or maple syrup)",
            "1 cup soft dates, pitted (175g)",
            "1 tbsp miso paste (20g)",
            "1 tsp molasses, optional (5g)",
            "½ tsp vanilla (3g)"
        ],
        "instructions": [
            "Add all the ingredients into a high speed blender in the order listed and blend until smooth and creamy. Scrape down the sides as needed. ",
            "Store in an air tight container in the fridge for up to 1 week or in the freezer for up to 3 months. "
        ],
        "link": "https://okonomikitchen.com/salted-date-caramel-sauce",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/salted-date-caramel-sauce-1-of-1-1024x683.jpg"
    },
    {
        "name": "Cauliflower Gnocchi Recipe",
        "servings": "4 servings",
        "ingredients": [
            "1 head of cauliflower, roughly chopped  (weighed at 1000g, 2.2 lbs or 1kg)",
            "1 cup cassava flour (120g)*",
            "1/4 cup potato starch (30g)",
            "1/2 of salt, optional"
        ],
        "instructions": [
            "Steam the cauliflower over a large steamer basket for 12-15 minutes, until soft. Alternatively, microwave the cauliflower in a microwave safe container on high for 8-10 minutes. A fork should go through the cauliflower without resistance. ",
            "Once cool enough to handle, squeeze out any excess cauliflower juice using a nut milk bag or lint-free dish towel. The cauliflower should weigh around 350-375g at this point. ",
            "Add the cauliflower into a food processor and blend until smooth (it will look some what gritty, but also blended together). Add in the flour, potato starch and salt. Blend until it comes together. If you have a “low” setting on your food processor, set it to low. I like to pulse blend and scrape down the sides so the dough isn’t over worked, especially if using non-gluten free flour. ",
            "Transfer the dough onto a lightly floured work surface. Add some flour to your hands and bring the dough together into a thick oval shape. Using a pastry cutter or sharep knife, cut the dough around 1 inch thick. Give them a quick roll to round out the edges and then cut into1/2 inch pieces. Now they’re ready to be cooked!",
            "TO BOIL: Bring a pot of salted water to a boil. Add cauliflower gnocchi and cook until they start to float (around 4 minutes), then remove them with a slotted spoon. ",
            "TO SAUTE: Use the boil method to cook the gnocchi. Spray pan with oil and then cook 5 minutes on each side until golden brown and crispy. ",
            "TO AIR FRY: Line the bottom of your air fryer basket with parchment paper and then add cauliflower gnocchi. Air fry at 400F for 8 minutes and then shake the basket to flip the gnocchi and air fry for another 8-9 minutes, until golden brown and crispy. Optional: spray with a bit of oil for extra crunchiness. ",
            "TO BAKE: Pre-heat oven to 400F. Line a baking sheet with parchment paper and add on the gnocchi. Bake for 15 minutes. Then flip the gnocchi and bake for another 10-15 minutes, until golden brown and crispy. Optional: spray with oil and season with dried herbs.\n\nTO SERVE: after using any of these methods to cook the gnocchi, serve with your favourite sauce, dip them in your favourite dip or coat them in some cinnamon sugar/seasonings and eat like a snack! \n\n",
            "TO SERVE: after using any of these methods to cook the gnocchi, serve with your favourite sauce, dip them in your favourite dip or coat them in some cinnamon sugar/seasonings and eat like a snack! ",
            "TO FREEZE: Place the gnocchi on a parchment lined baking tray. Once frozen, transfer into freezer bags or freezer-safe containers. They will last for 3-4 months in the freezer. No need to defrost the cauliflower gnocchi before cooking! Prepare them right out of the freezer. "
        ],
        "link": "https://okonomikitchen.com/cauliflower-gnocchi-recipe",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/cauliflower-gnocchi-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Tahini Chocolate Truffle Daifuku Mochi",
        "servings": "14 Truffle Mochi",
        "ingredients": [
            "1 3 oz dark chocolate bar, chopped finely (85g)",
            "1/2 cup tahini (120g)",
            "2 tbsp maple syrup (40g)",
            "1/2 tsp cinnamon, optional",
            "1/4 tsp salt, optional",
            "1/4 cup sweet rice flour (50g)",
            "1.5 tbsp sugar (20g)",
            "1/3 + 1 tsp water (85ml) ",
            "Potato starch for dusting ",
            "1/4 cup sweet rice flour – 1 tsp (48g)",
            "1.5 tbsp sugar (20g)",
            "1 tsp matcha (2g)",
            "1/3 + 1 tsp water (85ml) ",
            "Potato starch for dusting "
        ],
        "instructions": [
            "Place a glass bowl on top of a medium saucepan with simmering water over medium heat. Add in the chocolate, tahini, maple syrup, cinnamon and salt and stir until melted and well combined.",
            "Transfer chocolate into a flat glass container and place into the fridge to set (45-60 minutes). ",
            "Scoop 1 tbsp (around 17-18g each) of the chocolate and roll them into balls. I was able to get 14. Work quickly so that the truffles don’t melt in your hand. Place them onto a parchment lined baking tray and place into the freezer. ",
            "Add the sweet rice flour and sugar (and matcha for matcha mochi) into a glass bowl and whisk. Add in the water and whisk to combine. Cover with a damp paper towel and microwave on high (1100 W) for 1 minute. Mix mochi with a silicon spatula and microwave for another 30-40 seconds (it should no longer be liquid-y)",
            "Place parchment paper on your work surface. Dust generously with potato starch using a sifter. Transfer the mochi using the silicon spatula and then dust the mochi with more potato starch. Dust more potato starch onto your rolling pin or hands and then roll out the mochi into a thin layer. Place into the fridge for 10 minutes to cool. ",
            "Use a biscuit or cookie cutter and cut 7-8 rounds for both regular and matcha mochi. Place the cut out mochi onto a potato starch dusted plate or baking tray. If stacking one on top of each other, place parchment paper between each mochi. ",
            "Take the truffles out of the freezer. ",
            "Place one mochi on the palm of your hand and dust off the excess potato starch with a pastry brush.  Then place a truffle in the middle of the mochi wrapper. Pinch two opposite sides together and then pinch the other two opposite sides together. Firmly pinch the remaining 4 corners together. An optional step is to take a piece of saran wrap, place the mochi in the middle and tightly twist the saran wrap.",
            "Place the daifuku back onto the baking tray and repeat with remaining mochi. ",
            "Store truffles in a cool dry place (or in the fridge with a light towel on top) and consume within 2 days."
        ],
        "link": "https://okonomikitchen.com/tahini-chocolate-truffle-daifuku-mochi",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/11/chocolate-daifuku-mochi-1-of-1-1-1024x683.jpg"
    },
    {
        "name": "Vegan Kimchi Fried Rice",
        "servings": "2 servings",
        "ingredients": [
            "1 block smoked tofu, cubed (200g)",
            "1 cup homemade or store bought kimchi, roughly chopped (150g)",
            "1/2 cup frozen vegetables (80g)",
            "1.5 cup cooked rice (240g // day old and refrigerated, frozen OR under cooked preferred)",
            "1 tbsp dark soy sauce (tamari for gluten free)",
            "2 teaspoon sesame oil",
            "1/2 tbsp gochujang ",
            "3 scallions, whites and greens separated",
            "black sesame seeds",
            "nori strips"
        ],
        "instructions": [
            "In a medium sized wok (or frying pan) add the white parts of the scallions and fry over medium high heat for 1 minute with a drizzle of oil or water for oil free. Add in the kimchi and gochujang, and fry for another minute. Bring the heat down to a medium and add in the cooked rice, smoked tofu, frozen vegetables, and soy sauce. Fry until the rice has absorbed all the flavours.",
            "Then add in half of the green onion tops, drizzle in the sesame oil and fry for another minute. ",
            "Serve immediately and garnish with remaining green onions, sesame seeds and nori strips. "
        ],
        "link": "https://okonomikitchen.com/vegan-kimchi-fried-rice",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/vegan-kimchi-fried-rice-1-of-1-1024x683.jpg"
    },
    {
        "name": "Kabocha Brown Rice Soup",
        "servings": "2 servings",
        "ingredients": [
            "1/2 large onion (110g)",
            "1/4 kabocha (flesh only // 230g)",
            "3 cups kombu dashi (sea weed dashi // 640ml)",
            "1 cup cooked Japanese brown short grain rice (Genmai) ",
            "1/2 tsp dried thyme ",
            "1 tsp salt"
        ],
        "instructions": [
            "Add the onions into a medium pot and fry in water or a little oil over medium high heat (2 minutes).",
            "Once the onions become fragrant and slightly browned, add in the kabocha. Then pour in the kombu dashi and mix. Add in the cooked brown rice, dried thyme and salt. Bring the heat up to a high and allow the dashi to come to a boil. Then turn down the heat to a medium low and let the soup simmer for 15-20 minutes, or until kabocha is fork tender. ",
            "Use an immersion blender to blend until desired consistency. Or carefully blend the soup in a regular blender. Serve and enjoy! "
        ],
        "link": "https://okonomikitchen.com/kabocha-brown-rice-soup",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/kabocha-pumpkin-brown-rice-soup-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Kabocha Pumpkin Daifuku",
        "servings": "6 Daifuku Mochi",
        "ingredients": [
            "quarter of a medium kabocha (480g raw, no skin)",
            "2–3 tbsp sugar, optional* (24-36g // cane, white or coconut sugar) ",
            "1/2 cup shiratamako OR sweet rice flour (90g)",
            "3.5 tbsp white sugar* (45g)",
            "2/3 cup water (162g)",
            "1/2 – 2/3 cup potato starch for dusting (64-95g)"
        ],
        "instructions": [
            "Chop Kabocha into 1 inch pieces. Place in a microwave safe dish and microwave on high (1100 W) for 4-5 minutes, or until cooked through.",
            "Add cooked kabocha into a food processor or blender along with sugar (if using, see notes) and blend until smooth. ",
            "Transfer paste back into microwave safe dish and microwave for 3 minutes on high. Mix the paste and check consistency. If it still seems loose, microwave in 30 second intervals until thick. The paste should end up being anywhere from 200-215g depending on if any sugar is added. Let the paste cool for a few minutes by placing a icepack under the dish. ",
            "Divide the paste into 6 equal portions, around 33-34g each. Roll them into balls and place them on a parchment lined baking tray. Place in the fridge to let them firm up. ",
            "Combine the shiratamako and sugar into a bowl and whisk together. Add water and mix until well combined. Cover with a damp paper towel and microwave on high for 1 minute (1000 W). Mix with a silicon spatula and then microwave for another 30 seconds. Check to see if it’s done- there shouldn’t be any liquid remaining and the colour will look less solid. ",
            "Place a large piece of parchment paper on work surface and dust with potato starch. Use a silicon spatula to trasnfer the mochi onto potato starch. ",
            "Generously dust more potato starch on top of the mochi. Roll out the mochi, place onto a baking tray and place into the fridge for at least 10 minutes. ",
            "Take the mochi out of the fridge and cut into 6 circles using a medium to large cookie cutter (I used a 7.5cm // 3 inch cookie cutter). Eat the remaining scraps as you work. Take the kabocha balls out of the fridge. ",
            "Take one mochi sheet and brush off the potato starch. ",
            "Place kabocha ball in the middle of the mochi sheet. ",
            "Pinch two ends of the mochi together to cover the kabocha filling.",
            "Pinch the other two corners together. ",
            "Tuck and pinch the 4 remaining corners together until the bottom no longer has pointy corners sticking out. ",
            "Brush a bit of potato starch on the bottom and place on a plate. Repeat steps and finish making the rest of the daifuku mochi."
        ],
        "link": "https://okonomikitchen.com/kabocha-pumpkin-daifuku",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/kabocha-daifuku-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Apple Chia Jam",
        "servings": "1 1/2 cup",
        "ingredients": [
            "3 medium apples (I used 3 Gala Apples // 2 cups chopped // 600g)",
            "1/2 tsp salt",
            "2/3 cup fresh apple juice OR water (187ml)",
            "2 tbsp chia seeds",
            "1 tbsp lemon juice",
            "1 tbsp maple syrup*",
            "1/2 tsp cinnamon, optional"
        ],
        "instructions": [
            "Fill a large bowl with water halfway and mix in salt. Peel the apples and then place them into the salty water for 5 minutes. Reserve the apple skin. ",
            "Core and chop apples into 1 cm sized pieces cubes. ",
            "Add the apples, apple skin, fresh apple juice, chia seeds, lemon juice, maple syrup and cinnamon (if using) into a medium pot and bring to a low boil. ",
            "Simmer the jam 18-20 minutes over medium low until the apples are very tender and all the liquid has evaporated. Stir every 5 minutes with a wooden spoon. If the liquid has evaporated very quickly and the apples are not yet tender, add in 1-3 tbsp more apple juice or water. Remove the apple skins at around 10-15 minutes or when the apple skin has become dull. ",
            "Using the back of a wooden spoon, mash 50-60% of the apples until desired consistency. ",
            "Immediately transfer the jam into a well sterilized jar and close securely with a lid. Allow the jam to cool at room temperature and then refrigerate."
        ],
        "link": "https://okonomikitchen.com/apple-chia-jam",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/apple-chia-jam-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Gluten Free Apple Crisp",
        "servings": "2",
        "ingredients": [
            "2 small apples, peeled cored & chopped (I used one granny smith & one gala // 400g)",
            "2 tbsp maple syrup* (40g)",
            "1 tsp cinnamon OR apple pie spice",
            "pinch of salt",
            "1 tbsp lemon juice, optional",
            "1/4 cup oat flour made from gluten free rolled oats (OR pre-made oat flour, almond flour or gluten free flour blend // 32g )",
            "1/3 cup gluten free rolled oats (26g)",
            "3 tbsp light brown sugar** (38g)",
            "1 tbsp coconut oil*** (14g)",
            "1/2 tsp cinnamon ",
            "pinch of salt"
        ],
        "instructions": [
            "Preheat: Preheat oven to 350 F (180C)",
            "Prep Apples: Add apples to the baking dish and toss with sugar, cinnamon, salt and lemon juice.",
            "Prep Crisp Topping: In another bowl, add the gluten free flour, oats, light brown sugar, coconut oil, cinnamon and salt and mix until the texture is moist. ",
            "Bake: Sprinkle the crisp topping over the apples and bake for 30 minutes, or until golden brown on the top.",
            "Cool: Let the crisp rest for 5-10 minutes before serving. Serve with non-dairy vanilla ice cream, non-dairy yogurt, coconut whip cream, caramel, butter scotch sauce or enjoy on it own! "
        ],
        "link": "https://okonomikitchen.com/vegan-gluten-free-apple-crisp",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/vegan-gluten-free-apple-crisp-recipe-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Pumpkin Chocolate Chip Blondies (Vegan + Gluten-Free)",
        "servings": "9 servings",
        "ingredients": [
            "2/3 cup coconut sugar (128g) ",
            "1 tbsp molasses (14g)",
            "1/2 cup almond butter (128g)",
            "2/3 cup pumpkin puree (163g)",
            "1 tbsp vanilla extract",
            "2 tsp pumpkin pie spice",
            "1/2 tsp salt",
            "1 1/4 cup + 2 tbsp oat flour (160g)",
            "1/2 tsp baking soda",
            "2 tbsp tapioca starch (15g)",
            "1/3–1/2 cup chocolate, chopped, chips or chunks (80-125g)"
        ],
        "instructions": [
            "Preheat oven to 350F (180C)",
            "Into a large bowl combine the coconut sugar and molasses together. Whisk together until it turns into a similar consistency as brown sugar. ",
            "Add in the almond butter, pumpkin puree, vanilla extract and pumpkin pie spice. Whisk until smooth and combined. ",
            "Add in the salt, oat flour, baking soda and tapioca starch and mix until combined with the wet ingredients. Fold in half of the chocolate.",
            "Transfer mixture into a lined 8×8 inch baking tin. Flatten the tops with a spatula, your fingers or a flat potato masher (use parchment paper between the masher and dough so it doesn’t stick). ",
            "Top with remaining chocolate chips and then bake in the oven for 18-20 minutes. Rotate the baking tray at 10 minute. ",
            "Allow to cool for at least 10 minutes. Using a sharp knife cut into desired pieces. Eat immediately or store in a airtight container at room temperature for up to 3 days, in the fridge for up to 5 days or in the freezer for up to 1 month. "
        ],
        "link": "https://okonomikitchen.com/pumpkin-chocolate-chip-blondies-vegan-+-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/vegan-pumpkin-spice-chocolate-chip-blondies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Refried Bean Dip",
        "servings": "4 servings",
        "ingredients": [
            "2 garlic cloves, minced (8g)",
            "1/2 medium onion, chopped  (72g)",
            "1 can pinto beans (19oz can, 350g)",
            "4 pickled jalapeno slices",
            "1 tsp cajun powder",
            "2 tsp taco seasoning ",
            "1/2 tsp rosemary",
            "1/2 tsp salt",
            "handful of cilantro (15-20g)",
            "1 tbsp soy milk or water",
            "1 tbsp lime juice",
            "1/8 tsp cayenne, optional"
        ],
        "instructions": [
            "Over medium high heat, fry onions and garlic with a little water or oil (3 minutes).",
            "Then bring down the heat to a medium and add in the rinsed and drained pinto beans, cajun powder, taco seasoning, rosemary, cayenne powder (is using) and salt. Fry and mix until everything is well combined. Mash the pinto beans during this time and let it cook for 2-3 minutes.",
            "Transfer mixture into a food processor and add in the cilantro, lime juice and soy milk (or water). Blend until smooth and creamy, scraping down the sides as needed. "
        ],
        "link": "https://okonomikitchen.com/vegan-refried-bean-dip",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/vegan-refried-bean-dip-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Pumpkin Spice Protein Balls",
        "servings": "14 balls",
        "ingredients": [
            "3/4 cup peanut butter (187g)",
            "1/2 cup pitted soft dates, packed (85g)",
            "1/4 cup protein powder, vanilla or unflavoured (34g)",
            "1/4 cup chia seeds (40g)",
            "1/3 cup oat flour (45g)",
            "2 tsp pumpkin pie spice",
            "1/4 tsp salt",
            "Dark chocolate",
            "Hemp hearts ",
            "Coconut flakes",
            "Crispy rice"
        ],
        "instructions": [
            "Add all the ingredients into a food processor and blend until the ingredients form a cookie dough like consistency. ",
            "Scoop out 1 heaping tbsp of the mixture and roll them into balls. I was able to make 14 balls that weighed around 28g each. ",
            "Place them into a parchment lined tray or container. ",
            "Optional step: drizzle on some melted chocolate and top with hemp seeds (or crushed nuts/seeds of choice). ",
            "Place them into the fridge or freezer to firm up for at least 30 minutes. ",
            "Store in the fridge for up to 2 weeks or in the freezer for up to 1 month for best taste and texture. "
        ],
        "link": "https://okonomikitchen.com/pumpkin-spice-protein-balls",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/vegan-pumpkin-spice-protein-balls-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Mashed Potatoes",
        "servings": "4 servings",
        "ingredients": [
            "2 lbs / 4 large starchy potatoes (Yukon Gold or Russets)",
            "1 tsp salt ",
            "1/2 cup soy milk",
            "3–4 garlic cloves",
            "1/2 tsp black pepper ",
            "2 tsp dried herbs (rosemary, thyme, parsley or oregano)",
            "1 tbsp nutritional yeast, to taste ",
            "1 tbsp miso paste, to taste"
        ],
        "instructions": [
            "Wash & Cut Potatoes: Scrub and wash the potatoes and then chop them into quarters. If using smaller potatoes, chop them in half. Rinse the potatoes with cold water and then place them into the instant pot. Mix 1 tsp of salt with 1 1/2 cup water and then pour it into the instant pot.",
            "Cook Potatoes: Seal instant pot with the lid and set to MANUAL for 6 minutes on high. NOTE: It takes around 5 minutes for the instant pot to actually start cooking. Once the timer goes off, allow the steam to release naturally or carefully move the valve open. The potatoes should be fork tender. Drain the potatoes and then set the instant pot to SAUTEE over low heat. ",
            "Peel & Dry Potatoes: As the instant pot is heating up, carefully peel the skins off the potatoes. I like to keep some on for texture. Move the potatoes around using a wooden spoon so they don’t burn (2-3 minutes)",
            "Flavour & Mash the Potatoes: One the potatoes look slightly dried out, add in the garlic, add-ins, soy milk, salt and pepper. Use a potato masher or pastry cutter to mash the potatoes to desired consistency. ",
            "Taste & Season: Taste the potatoes and add in any additional salt or pepper as needed before serving. ",
            "Wash & Cut Potatoes: Scrub and wash the potatoes and then chop them into quarters. If using smaller potatoes, chop them in half. Rinse the potatoes with cold water and then place them into a large pot. ",
            "Cook Potatoes: Fill the pot with enough cold water to cover the potatoes. Leave 1 inch of space at the top so the pot doesn’t overflow. Bring the water to a boil, cover with a lid and reduce the heat to medium. Continue to cook for 12-15 minutes, or until fork tender. Remove from the heat and drain the potatoes. ",
            "Peel & Dry Potatoes: Bring the pot back onto the stove over low and carefully peel the skins off the potatoes. I like to keep some on for texture. Move the potatoes around using a wooden spoon so they don’t burn (2-3 minutes).",
            "Flavour & Mash the Potatoes: One the potatoes look slightly dried out, add in the garlic, add-ins, soy milk, salt and pepper. Use a potato masher or pastry cutter to mash the potatoes to desired consistency. ",
            "Taste & Season: Taste the potatoes and add in any additional salt or pepper as needed before serving. "
        ],
        "link": "https://okonomikitchen.com/vegan-mashed-potatoes",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/the-best-vegan-mashed-potatoes-1-of-1-1024x683.jpg"
    },
    {
        "name": "Best Vegan Gluten Free Biscuits",
        "servings": "6 biscuits",
        "ingredients": [
            "2 cups gluten free all purpose flour blend (250g)*",
            "2/3 cup light coconut OR cashew milk (130g)**",
            "1/2 cup coconut cream (120g)***",
            "1 tbsp baking powder (aluminum free preferred) ",
            "2 tsp lemon juice or apple cider vinegar",
            "1 tbsp cane sugar (13g)",
            "1 tsp salt",
            "2 tbsp nutritional yeast, optional for a cheesy flavour",
            "2 tsp dried herbs (I used rosemary), optional for herb-y biscuits"
        ],
        "instructions": [
            "Into a small bowl, whisk together the non-dairy milk and lemon juice, this will make vegan buttermilk ",
            "Into a food processor, add in the flour, baking powder, sugar, salt, nutritional yeast and dried herbs (if using) and blend until combined (around 10 seconds).",
            "Add in the buttermilk and drop in the coconut cream. Pulse blend 5-6 times, just until it starts to look crumbly. From here, it’s important to work fast. ",
            "Transfer the dough onto a parchment lined floured surface. Dust your hands with flour and then pat the dough out into a rectangle, around 1/2 an inch thick. Then fold the dough inward into 1/3 (refer to photo). Use the parchment paper to lift the sides inwards so that you don’t have to keep adding flour (to prevent them from becoming too dry). Repeat this step 2 more times. ",
            "After the third time, using your hands flatten the dough into 1/2 inch thick. ",
            "With a 2-inch round metal biscuit cutter, firmly push straight down through the dough without twisting the cutter. If you do not have a biscuit cutter, use a knife and cut the dough into 6 squares. You should be able to cut out 5 circular biscuits. ",
            "Use the scraps of the dough to form one more biscuit, 1 inch in thickness. ",
            "Place the biscuits in the freezer and then preheat the oven to 230 C (450 F).",
            "Once fully preheated, brush some melted coconut cream on top of the biscuits and bake in the oven for 15-18 minutes or until the tops are golden brown. ",
            "Transfer to a cooling rack and enjoy immediately. "
        ],
        "link": "https://okonomikitchen.com/best-vegan-gluten-free-biscuits",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/10/vegan-gluten-free-biscuits-recipe-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Vegan Kabocha Pumpkin Cinnamon Rolls",
        "servings": "6",
        "ingredients": [
            "3/4 cup kabocha, cooked (150g)",
            "1/2 cup unsweetened soy milk (120ml)",
            "1 tsp active dry yeast (5g)",
            "2 tbsp maple syrup, divided",
            "2.5 cup all purpose flour (300g // gluten free all purpose flour*)",
            "2 tbsp coconut cream (30g)",
            "1 tsp salt",
            "1/3 cup coconut sugar (64g)",
            "1 tbsp pumpkin pie spice",
            "1/2 cup walnuts (58g)",
            "1 cup powdered sugar",
            "2 tbsp maple syrup ",
            "1 tbsp non-dairy milk"
        ],
        "instructions": [
            "Microwave 200g of raw kabocha squash on high for 4 minutes, or until fully cooked. Discard the skin and mash until it turns into a paste. Then, portion out 150g (please see note #1).",
            "Heat non-dairy milk in the microwave for 15 seconds or until warm to the touch. The milk should not be TOO hot or it will kill the yeast. Mix in the yeast and 1 tbsp of maple syrup until combined. Allow the yeast to activate for 5 minutes, or until bubbly.",
            " Add the flour, kabocha pumpkin, coconut cream, salt and salt into your bread machine Then add in the milk yeast mixture. Close the bread machine and set to “dough” (your bread machine may be set to the basic setting). Let it run it’s cycle, this will take about 1 hour. (Please see note #2 for no-bread machine method).",
            "Combine the coconut sugar, pumpkin pie spice and walnuts in a bowl. As well, prep a flat working surface by lightly dusting with flour. ",
            "Once the dough is finished kneading and has doubled in size, flour your hands, punch the dough down and transfer to working surface. Knead the dough 4-5 times and gather to form a flat ball. Roll the dough into a rectangle. The dough shouldn’t be too thin or too thick (approx. 1/2 cm). ",
            "Brush the dough with maple syrup. Spread the cinnamon sugar walnut mixture evenly, leaving 1 cm of space at the top.",
            "Starting at the end closes to you, roll the dough tightly upwards. Then with a sharp knife, divide the dough into 6 equal sized pieces. Clean your knife after each cut for clean cuts",
            "Transfer the dough into a 8×12 inch baking pan. Cover with plastic wrap or a damp light cloth and let it sit in a warm area for 20-30 minutes or until it doubles in size (please see note #3). Pre-heat oven to 180C (350F).",
            "Remove the wrap and bake in preheated oven for 10 minutes. Rotate the baking pan and bake for another 8-10 minutes, or until golden brown on top. ",
            " Allow the cinnamon rolls to cool on a cooling rack in the pan for a few minutes. In the mean time, whisk together the powdered sugar, maple syrup and non dairy milk in a small bowl to make the glaze. Drizzle on the maple glaze and serve immediately. "
        ],
        "link": "https://okonomikitchen.com/vegan-kabocha-pumpkin-cinnamon-rolls",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/vegan-gluten-free-kabocha-pumpkin-cinnamon-rolls-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Flourless Pumpkin Brownies",
        "servings": "9 servings",
        "ingredients": [
            "1/2 cup almond butter (130g)*",
            "1/2 cup pumpkin puree (120g)",
            "1/4 cup maple syrup (85g)**",
            "1 tbsp ground flax seed + 2 tbsp water",
            "1/4 cup cocoa powder (21g)",
            "2 tsp vanilla ",
            "1/2 tsp baking soda ",
            "1/2 tsp salt",
            "1/4 cup chocolate chips (45g)",
            "1/2 tbsp pumpkin pie spice, optional",
            "1 tbsp coconut cream, optional***"
        ],
        "instructions": [
            "PREHEAT: Preheat the oven to 350 F (180 C).",
            "BATTER: Add all the ingredient except the chocolate chips into a food processor and process until smooth. Scrape down the sides as needed to make sure everything is well combined. Then mix in the chocolate. ",
            "BAKE: Transfer the brownie batter into a lined 6×6 inch baking pan and bake in the oven for 35-40 minutes. Check doneness by inserting the toothpick into 2-3 spots, the toothpick should come out with brownie crumbs (NOT raw batter) sticking to the toothpick. ",
            "COOL: Allow the brownies to cool for 15 minutes and then transfer to a wire rack to let them cool completely before cutting. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-flourless-pumpkin-brownies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/vegan-gluten-free-flourless-pumpkin-brownies-1-of-1-1024x683.jpg"
    },
    {
        "name": "Air Fryer Caramelized Stone Fruits",
        "servings": "2 servings",
        "ingredients": [
            "1 lbs / 2-3 stone fruits such as peaches, nectarines, plums or apricots",
            "1 tbsp Maple syrup",
            "1/2 tbsp tbsp Coconut sugar",
            "1/4 tsp Cinnamon, optional",
            "pinch of salt, optional"
        ],
        "instructions": [
            "PREPARE AIR FRYER: Cut a sheet of parchment paper that will fit the floor of your air fryer basket and then place inside the basket.",
            "PREPARE FRUIT: Slice the stone fruit down the middle and remove the seed. Then brush some maple syrup on the flesh and sprinkle with some coconut sugar. Add in a pinch of cinnamon and salt if desired.",
            "AIR FRY: Place the stone fruit in the air fryer basket and air fry at 350 for 15 minutes or until caramelized.*"
        ],
        "link": "https://okonomikitchen.com/air-fryer-caramelized-stone-fruits",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/air-fryer-caramelized-stone-fruit-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Pumpkin Dog Treats",
        "servings": "40 treats",
        "ingredients": [
            "3/4 cup pumpkin puree (185g)",
            "1/4 cup peanut butter (60g)",
            "2 tbsp ground flax meal ",
            "1 1/3 cups oat flour (160-180g)*",
            "1/2 tsp cinnamon, optional"
        ],
        "instructions": [
            "Preheat: Pre-heat oven to 350 F. ",
            "Combine: Add the pumpkin puree, peanut butter, flax meal and cinnamon (if using) into a food processor and blend until combined.",
            "Process: Add in the oat flour and process until a dough forms. ",
            "Cut: Lightly flour a cutting board and roll out the dough (around 1/4 inch thick). Use cookie cutters to cut as many pieces as you can and place them onto a parchment lined baking tray. Gather the remaining dough and repeat until you run out of dough. ",
            "Bake: Bake for 30-35 minutes. ",
            "Let them cool on a cooling rack and them store in the fridge for 1 week or freezer for 2 months. "
        ],
        "link": "https://okonomikitchen.com/vegan-pumpkin-dog-treats",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/vegan-pumpkin-dog-treats-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Plum Crisp",
        "servings": "6 servings",
        "ingredients": [
            "1.75 lbs ripe plums, halved (795g)",
            "1/2 tbsp arrowroot flour",
            "1 tsp vanilla extract",
            "1 1/4 cup rolled oats, gluten free as needed (100g)",
            "1/3 cup almond flour (38g)",
            "1/4 cup + 2 tbsp maple syrup (120g)",
            "1/4 cup almond butter (62g)",
            "1/2 tsp cinnamon",
            "1/2 tsp salt "
        ],
        "instructions": [
            "Preheat: Preheat oven to 350F.",
            "Plums: Slice the plums in half (slice into quarters if using larger plums), remove the seeds and add them into a 9×10 inch baking dish. Toss the plums with the arrowroot, 2 tbsp of maple syrup and 1 tsp of vanilla.",
            "Crisp: In a separate bowl, mix together the oats, almond flour, cinnamon, salt, almond butter and maple syrup. Use your hands to combine the mixture until crumbly. ",
            "Bake: Add the crisp crumble mixture on top of the plums and bake for 40-45 minutes, until the crisp is golden and the plums have released their juices. ",
            "Serve: Plate up the crisp immediately and top with whip cream or ice-cream! "
        ],
        "link": "https://okonomikitchen.com/vegan-plum-crisp",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/vegan-gluten-free-plum-crisp-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Take Away Sushi Rolls",
        "servings": "8 Rolls",
        "ingredients": [
            "4 pieces of nori seaweed",
            "2 rice cooker cups sushi rice / Japanese short grain rice",
            "1/4 cup rice vinegar",
            "1.5 tbsp sugar",
            "1 tsp salt",
            "4 strips pre-cooked kanpyo (gourd strips)*",
            "1 Japanese cucumber (or 2 Persian cucumbers)",
            "4 strips pickled daikon",
            "1 avocado, sliced",
            "1 medium carrot, thinly sliced",
            "1/2 block smoked tofu"
        ],
        "instructions": [
            "Prepare the rice by adding 2 cups of rice cooker cups into your rice cooker and adding water until the #2 line.",
            "Next, prepare the filling ingredients by cutting them into strips (they can be half the length of the nori sheet or the full length, around 1cm in thickness).",
            "Prepare your work station by lining up the nori, sushi (covered with a damp cloth) and your fillings",
            "Place a nori sheet smooth side down on a bamboo sushi rolling mat. The nori should be placed at the end of the mat closest to you for easy rolling.",
            "Wet your hands with the vinegar water and scoop out 1/4th of the rice. Spread and gently press the rice over the nori (without squishing the rice), leaving 1.5-2 cm at the top uncovered.",
            "Place your filling onto the nori sheet starting with firmer fillings (such as tofu or pickled radish) towards the bottom (this makes it easier to roll the ingredients over without it getting too messy).",
            "Starting from the bottom, use your thumb and index finger to hold the mat and sushi rice while using your middle, ring and pinky finger to hold the fillings on top. In one swift motion, bring the roll over top of the other fillings (in the direction away from you) and tightly squeeze.",
            "Lift the bamboo mat and roll until again and tightly squeeze. Continue until you’re at the top of the roll.",
            "The bamboo mat should be covering the entire roll at the end and give it one last gentle but tight squeeze.",
            "Remove the mat and then with a sharp knife, cut straight down the middle.",
            "After each cut, wipe the knife with a wet towel so the rice doesn’t stick to the knife."
        ],
        "link": "https://okonomikitchen.com/vegan-take-away-sushi-rolls",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/vegetable-tofu-sushi-rolls-recipe-1-of-5-1024x683.jpg"
    },
    {
        "name": "Air Fryer Tahini Chocolate Chunk Oatmeal Cookies",
        "servings": "8 cookies",
        "ingredients": [
            "1/3 cup tahini (80g)",
            "1/4 cup maple syrup (80g)",
            "1 cup gluten-free oat flakes (80g)*",
            "2 tbsp almond flour (14g)",
            "1/4 cup chocolate chunks (40g)",
            "1/4 cup walnuts (40g)",
            "1 tsp vanilla, optional",
            "1 tsp cinnamon, optional",
            "1/4 tsp salt"
        ],
        "instructions": [
            "PRE-HEAT: Pre-heat air fryer to 350 F.",
            "MIX: In a large bowl mix together the tahini, maple syrup, vanilla (if using), cinnamon (if using) and salt. Mix  in the oat flakes, almond meal and walnuts. Fold in the chocolate chips. ",
            "FORM COOKIES: Using a heaping tbsp, divide the cookie dough into 8 equal amounts (around 42 grams each). Roll the dough with damp hands (this prevents sticking) and then flatten between the palms of your hands or by pressing down with a spatula. Place 4 cookies (or more if you have a bigger air fryer) into a parchment lined air fryer (PLEASE READ NOTE BELOW ON THIS).",
            "AIR FRY: Air fry the cookies at 350 F for 5-6 minutes. If you like your cookies super crisp (the ones that are darker in the photo), air fry at 350 F for 6-8 minutes (Please read note below)."
        ],
        "link": "https://okonomikitchen.com/air-fryer-tahini-chocolate-chunk-oatmeal-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/air-fryer-tahini-chocolate-chunk-oatmeal-cookies-1-of-1-2-1024x683.jpg"
    },
    {
        "name": "Vegan Tofu Poke Bowl",
        "servings": "4 servings",
        "ingredients": [
            "2 rice cooker cup short grain rice, dry (360g)",
            "1 recipe of crispy tofu",
            "1 cup sea weed salad",
            "1 Japanese cucumber (or 2 Persian cucumbers)",
            "1 small can of mandarin oranges, drained & rinsed",
            "1 cup shelled edamame",
            "3/4 cup grape tomatoes",
            "2 avocados",
            "pickled ginger or beni shoga, optional",
            "sesame seeds, optional",
            "aonori (finely chopped seaweed), optional",
            "scallions, optional",
            "togarashi, optional",
            "1/4 + 2 tbsp ponzu sauce"
        ],
        "instructions": [
            "Measure and rinse the rice. Add the rice into the rice cooker and fill until the “2” line.",
            "While the rice is cooking, gather all your ingredients. Heat edamame as per instruction on the package. Open the tin of mandarin oranges, drain and rinse. Cut cucumbers into thin slices. Cut grape tomatoes in half, lengthwise. Cut avocados into slices or cubes. Thinly slice scallions. ",
            "Once the rice is done cooking, mix and let it sit for a couple of minutes. Scoop some rice into a shallow bowl. Add a portion of crispy soy, sea weed salad, cucumbers, mandarin oranges, edamame, grape tomatoes and avocado. Garnish with some pickled ginger, sesame seeds, aonori, scallions and/or togarashi. ",
            "Drizzle on the ponzu sauce and enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-tofu-poke-bowl",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/easy-vegan-tofu-poke-bowl-with-ponzu-sauce-recipe-1-1-of-1-1-1024x683.jpg"
    },
    {
        "name": "Quick and Easy Crispy Air Fried Tofu",
        "servings": "4 Servings",
        "ingredients": [
            "13 oz extra firm tofu",
            "1.5 tbsp tamari (or soy sauce if not gluten-free)",
            "1.5 tbsp nutritional yeast",
            "1 tbsp corn starch"
        ],
        "instructions": [
            "Press: Press the tofu with a tofu press or by wrapping it in a kitchen towel and placing a heavy board or pan on top (refer to photo above). Cube the tofu into roughly 1/2-3/4 inch pieces. ",
            "Pre-heat: Pre-heat air fryer at 380 F.",
            "Flavour: Add the tofu into a bowl along with the tamari. Place a lid over the bowl and shake to toss. Sift in the corn starch and add in the nutritional yeast. Place the lid over again and shake to toss until the pieces of tofu are all coated. ",
            "Air Fry: Transfer the tofu into the air fryer and air fry at 380 F for 7 minutes. Shake the pan and air fry for another 7-8 minutes or until crispy. "
        ],
        "link": "https://okonomikitchen.com/quick-and-easy-crispy-air-fried-tofu",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/the-best-crispy-air-fryer-tofu-26-of-27-683x1024.jpg"
    },
    {
        "name": "Vegan Apple Cinnamon Bread with Crumb Topping",
        "servings": "8 slices",
        "ingredients": [
            "1 tbsp maple sugar",
            "2 tbsp almond meal",
            "2 tbsp oat flakes",
            "1/4 teaspoon cinnamon",
            "1 tablespoon coconut or almond butter ",
            "2 tbsp ground flax seeds + 6 tbsp water",
            "1/4 cup coconut sugar (50g)",
            "1/4 cup peanut butter (45g)",
            "1/2 cup + 2 tbsp soy milk (160g)",
            "1 tbsp apple cider vinegar ",
            "1 tsp vanilla",
            "1.5 cup shredded apples (185g)",
            "1 3/4 cup gluten free flour (210g)",
            "1 tsp baking soda",
            "2 tsp baking powder ",
            "1 tsp cinnamon "
        ],
        "instructions": [
            "Preheat oven to 350 F. Line a 8×4.5 inch loaf pan or spray with oil.",
            "Flax egg: mix the ground flax seeds with water and let it sit for 10 minutes.",
            "Crumb Topping: Into a small bowl combine all the ingredients for the crumb topping. Pinch the mixture between your fingers until crumbly and mixed throughly.",
            "Wet Ingredients: Into a bowl combine the wet ingredients EXCEPT the grated apple. Whisk throughly until well mixed. Then add in the grated apple and mix again.",
            "Dry Ingredients: Sift in the dry ingredients. Using a spatula mix until well combined using folding motions. ",
            "Transfer: The batter into a loaf pan and flatten the top using the spatula. Evenly top with the crumb topping.",
            "Bake: in the oven for 30 minutes. Remove it from the oven and cover with foil. Then bake for another 20-25 minutes or until toothpick comes out clean.",
            "Cool: in the loaf pan for 10 minutes. Then carefully remove from the loaf pan and allow it to completely cool on a cooling rack before slicing through. "
        ],
        "link": "https://okonomikitchen.com/vegan-apple-cinnamon-bread-with-crumb-topping",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/09/vegan-gluten-free-apple-bread-with-crumb-topping-ON-PLATE-1-of-1-1024x683.jpg"
    },
    {
        "name": "Spicy Eggplant and Tomato Dip",
        "servings": "4 servings",
        "ingredients": [
            "1 large onion (250g), thinly sliced",
            "2 garlic cloves, minced",
            "2 Japanese eggplants, sliced (approx. 1 cm thick) (400g)",
            "2 cups diced tomatos (500g)",
            "2 tbsp sugar-free ketchup (40g)",
            "1 tbsp coconut sugar (20g)",
            "1/4 tsp cayenne",
            "salt to taste"
        ],
        "instructions": [
            "Into a large deep pan (or pot), add in 1 tbsp of oil (or water for oil-free), and fry the onion and garlic for 2-3 minute over medium high heat- until lightly caramelized. ",
            "Add in the sliced eggplants and cook for 3 minutes, until softened.",
            "Add in the diced canned tomatoes, ketchup, coconut sugar, cayenne and salt. ",
            "Bring the heat down to a medium-low and mix. Allow it to simmer for 5 minutes, or until the liquid has reduced into a thick dip consistency.",
            "Add more coconut sugar, cayenne or salt- to taste.",
            "Transfer to a bowl and serve!"
        ],
        "link": "https://okonomikitchen.com/spicy-eggplant-and-tomato-dip",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/vegan-spicy-eggplant-tomato-dip-1-of-1-1024x683.jpg"
    },
    {
        "name": "Japanese Sweet Potato Smoothie",
        "servings": "1 serving",
        "ingredients": [
            "3/4 cup soy milk",
            "1/2 block silken tofu (100g)",
            "2 soft dates, pitted (20g)",
            "1/2 cup Japanese sweet potato, mashed (127g)",
            "1 frozen banana (120g)",
            "1 tbsp tahini (15g)",
            "1 tsp vanilla",
            "1 cup ice, optional",
            "1 tsp maca, optional",
            "1/2 tsp cinnamon, optional\n\n\n\n\n\n\n\n",
            "black sesame seeds to garnish, optional"
        ],
        "instructions": [
            "Add all the ingredients in the order listed, then blend until smooth and creamy!"
        ],
        "link": "https://okonomikitchen.com/japanese-sweet-potato-smoothie",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/japanese-sweet-potato-smoothie-1-of-1-1024x683.jpg"
    },
    {
        "name": "Mixed Berry Watermelon Smoothie",
        "servings": "1 serving",
        "ingredients": [
            "1/2 cup water (125 ml)*",
            "2 cup fresh watermelon, cubed (300g)**",
            "1/3 cup tofu (80g)***",
            "1 cup mixed frozen berries (125g)",
            "1 small banana, frozen (120g)",
            "pinch of salt"
        ],
        "instructions": [
            "Add all the ingredients into a blender in the order listed. Blend until smooth & creamy!"
        ],
        "link": "https://okonomikitchen.com/mixed-berry-watermelon-smoothie",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/berry-watermelon-smoothie-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Matcha Banana Smoothie",
        "servings": "1 serving",
        "ingredients": [
            "1 cup coconut water*",
            "1 large banana, frozen",
            "1 tsp matcha powder",
            "1 tbsp chia seeds",
            "1 tsp kale powder",
            "1 soft date"
        ],
        "instructions": [
            "Add all ingredients into a high speed blender. Blend until smooth and creamy. Pour into a serving glass and enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-matcha-banana-smoothie",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/vegan-green-tea-matcha-banana-smoothie-2-of-2-1024x683.jpg"
    },
    {
        "name": "Vegan Cornbread Waffles (Gluten-Free)",
        "servings": "3 Large Waffles",
        "ingredients": [
            "1 cup soy milk (250ml)",
            "1/2 tbsp apple cider vinegar",
            "1 tbsp flax meal + 3 tbsp water",
            "1 c gluten free flour (120g) ",
            "2 tsp baking powder",
            "1/2 tsp baking soda",
            "1 cup corn meal (100g)",
            "1 tsp salt",
            "1 tsp vanilla ",
            "1/4 cup unsweetened non-dairy yogurt",
            "1–2 tbsp maple syrup"
        ],
        "instructions": [
            "Make the flax egg by mixing together 1 tbsp round flax seeds and 3 tbsp of water.",
            "Prep the butter milk by mixing the soy milk and apple cider vinegar. Let these sit for 5 minutes.",
            "Sift the gluten free flour, salt, baking soda and baking powder into a large bowl. Then add in the corn meal and mix to combine. Sifting helps prevent unwanted clumps from forming. Mix the dry ingredients together.",
            "Then add in the ‘butter milk’, yogurt and flax egg. Mix everything together with a spatulate to ensure the dry ingredients stuck on the side of the bowl also get incorporated. Pre-heat the waffle iron on high and let the batter sit for at least 5 minutes. ",
            "Pour the waffle batter into the iron and let them cook on medium high for 5-7 minutes- or until crispy on the outside. Depending on the size of your waffle iron, use 3/4-1 cup of batter per waffle."
        ],
        "link": "https://okonomikitchen.com/vegan-cornbread-waffles-gluten-free",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/vegan-gluten-free-cornbread-waffle-main-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Strawberry Matcha Latte",
        "servings": "1 drink",
        "ingredients": [
            "1.5 cup strawberries (250g)",
            "2 tbsp maple syrup, divided (40g)",
            "1/4 cup evaporated coconut milk (62g)",
            "1 tsp matcha (3g)",
            "1/4 cup boiling water ",
            "1/3 cup grass jelly, cut into 1/2 inch cubes (130g)",
            "1/2 cup ice"
        ],
        "instructions": [
            "Strawberry Sauce: In a medium sauce pan add the strawberries and 1 tbsp maple syrup over medium heat. Allow it to come to a boil and then reduce the heat to low. Mash the strawberries and simmer for 6-8 minutes or until the liquid reduces in volume. Remove from the heat and let it cool. Place into the fridge once it reaches room temperature.",
            "Milk Layer: Whisk together the evaporated coconut milk and 1 tbsp of maple syrup. ",
            "Matcha layer: Whisk the matcha with the boiling water with a matcha tea whisk. ",
            "Layer the ingredients in this order: 1/4 cup of the strawberry sauce, grass jelly, sweet milk, ice & matcha. "
        ],
        "link": "https://okonomikitchen.com/vegan-strawberry-matcha-latte",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/vegan-strawberry-matcha-latte-1-of-1-1-1024x683.jpg"
    },
    {
        "name": "1-Bowl Vegan Zucchini Bread",
        "servings": "6 slices",
        "ingredients": [
            "1.5 tbsp ground flax seeds + 4 tbsp water (10g)",
            "1/3 cup + 1 tbsp coconut sugar  (72g)",
            "1/4 cup apple sauce (62g)*",
            "1/4 cup peanut butter (62)",
            "1/2 tbsp apple cider vinegar (8g)",
            "2 tsp vanilla (10g)",
            "1 large zucchini (230g, 170g after squeezing out excess liquid)",
            "1 3/4 cup all purpose gluten free flour (190g)",
            "1 tsp baking soda",
            "2 tsp baking powder",
            "1.5 tsp cinnamon, optional"
        ],
        "instructions": [
            "Preheat oven to 350F. Grease or line a 8×4 inch loaf pan with parchment paper. ",
            "In a bowl, mix the flax seed and water together and let it sit for 10 minutes until thick.",
            "In the meantime, grate the zucchini and then gently squeeze out excess liquid. It should weight around 230g before squeezing out the liquid and then 170g after. ",
            "Into a large bowl, add in the coconut sugar, apple sauce, peanut butter, apple cider vinegar, and vanilla. Stir well to combine. Then mix in the flax egg and zucchini.",
            "Sift in the flour, baking powder,baking soda and cinnamon if using. Mix the batter using a folding motion until everything is well combined.",
            "Pour the batter into the lined loaf pan and place into the oven for 50-55 minutes. At the 30 minute mark, rotate the loaf pan and cover with tin foil. Place it back into the oven until fully cooked through. Test with a toothpick by inserting it in the middle of the loaf and making sure it comes out clean. ",
            "Allow it to cool in the loaf pan for 10 minutes. Carefully remove from the pan and allow it to fully cool before slicing through."
        ],
        "link": "https://okonomikitchen.com/1-bowl-vegan-zucchini-bread",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/vegan-gluten-free-zucchini-bread-1-of-1-1024x683.jpg"
    },
    {
        "name": "Korean Spinach Side Dish (Sigeumchi-namul)",
        "servings": "2 servings",
        "ingredients": [
            "1 bunch spinach, stems discarded (300g)",
            "1 tbsp soy sauce",
            "½ tbsp sesame oil",
            "1–2 garlic cloves, finely minced",
            "1/2 tbsp sesame seeds",
            "pinch of salt"
        ],
        "instructions": [
            "Cut the stems of the spinach off and rinse thoroughly. Bring a large pot of water to a boil and blanche the spinach for 40-60 seconds (until the stems are no longer tough). If using baby spinach, blanch for around 30-50 seconds.",
            "Quickly drain the spinach into a colander and rinse with cold water to stop the cooking process. Squeeze out as much excess liquid from the spinach, then cut the ball of spinach in half. ",
            "Combine the rest of the ingredients together into a bowl and whisk until combined. Using your hands, mix the spinach with the prepared sauce.",
            "Transfer to serving bowl and enjoy!"
        ],
        "link": "https://okonomikitchen.com/korean-spinach-side-dish-sigeumchi-namul",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/korean-spinach-side-dish-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Kimbap with Tofu",
        "servings": "4 rolls",
        "ingredients": [
            "3–4 Korean sea weed (or nori wraps)",
            "2 rice cooker cup, short grain rice",
            "1.5 tbsp sesame oil",
            "1–2 tsp salt (to taste)",
            "2 small cucumbers, sliced vertically",
            "1 small carrot (70g)",
            "1 recipe braised burdock root",
            "1/4 pack of yellow pickled radish, sliced vertically (80g)",
            " ½ package firm tofu (200g)",
            "1 tbsp corn starch",
            "1/2 container of spinach (5 oz)",
            "1 garlic clove, finely minced",
            "1/2 tsp sesame oil "
        ],
        "instructions": [
            "RICE: Cook the short grain rice as per usual.",
            "TOFU: Cut the tofu into vertical slices, around ½ inch thick. Coat with the corn starch and season with some salt. Over medium heat, fry the tofu in some oil until brown and crispy. Transfer onto a plate to cool.",
            "CARROTS: In the same pan, add the julienned carrots. Season with a little sesame seed oil and salt for 2-3 minutes, until cooked.",
            "SPINACH: Bring a pot of water to a boil. Blanch the spinach for 30 seconds, strain and rinse with cold water to stop the cooking process. Squeeze out any excess water and cut the ball of spinach in half. Season with minced garlic, sesame oil and salt.",
            "BURDOCK: Prepare the burdock following this recipe.",
            "FRESH VEG: Slice the cucumber and yellow pickled radish into vertical sticks, around ½ inch in width.",
            "SEASONED RICE: Once all the filling ingredients are ready, transfer the cooked rice into a large bowl. Add in the sesame oil and salt and mix using a ride paddle (be careful not to over mix and “squish” the rice).",
            "ASSEMBLE: Place a sheet of seaweed onto a bamboo mat (shiny side down). Spread ¾ cup of rice onto the seaweed as evenly as possible using wet fingers, leaving around 2 cm of space at the top. Add the filling ingredients by layering it over the rice on the side closest to you.",
            "ROLL: Once all the filling is in place, lift the bottom edge (with the matt) and roll over the filling ingredients. Press firmly against the bamboo matt and continue until you each the top. The seaweed should hold together at the end from the moisture of the rice. Lightly brush the roll with some sesame oil. Using a sharp knife, cut the roll into 8 equal pieces. Wipe your knife with a damp cloth or towel after every cut to make clean cuts."
        ],
        "link": "https://okonomikitchen.com/vegan-kimbap-with-tofu",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/vegan-kimchi-pancakes-1-of-1-1024x683.jpg"
    },
    {
        "name": "Kinpira Gobo (Braised Burdock Root)",
        "servings": "4 servings",
        "ingredients": [
            "2 burdocks, 270g (200g edible portion)",
            "1 tbsp + 1 tsp sesame oil",
            "1 tbsp sake",
            "1 soy sauce",
            "1 tbsp sugar",
            "½ tbsp toasted sesame seeds",
            "Ichimi Togarashi (Japanese chili powder), optional"
        ],
        "instructions": [
            "Scrape the skin of the burdock using the back of a knife. Rinse the root, then slice into match stick sized pieces. Alternatively, use a mandolin or vegetable peeler to make thin strips.",
            "Soak the burdock in water for 10 minutes. Change the water every time it gets cloudy (I do this around 2-3 times). ",
            "Combine the sake, soy sauce and sugar in a bowl and mix until the sugar dissolves. ",
            "In a large pan, heat the sesame oil over high heat and add the burdock root. Stir fry for around 3 minutes (4 minutes if the root is cut my hand).",
            "Add in the seasoning mix and cook until the liquid significantly reduces. Add in the sesame seeds and Japanese chili powder. Serve & enjoy!"
        ],
        "link": "https://okonomikitchen.com/kinpira-gobo-braised-burdock-root",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/08/kinpira-gobo-japanese-burdock-1-of-1-1024x683.jpg"
    },
    {
        "name": "Vegan Kimchi Pancakes (Kimchijeon)",
        "servings": "1 Pancake",
        "ingredients": [
            "1/2 cup all purpose flour",
            "1/4 cup potato starch (or rice flour)",
            "1/4 tsp salt",
            "1 cup kimchi, chopped",
            "2 scallions roughly chopped into 1 inch pieces",
            "3 tbsp kimchi juice",
            "1/3–½ cold cup water",
            "3 tbsp soy sauce",
            "1 tbsp rice vinegar",
            "1 tsp sesame oil",
            "1 tsp sugar",
            "1/2–1 tsp chili oil"
        ],
        "instructions": [
            "Chop the kimchi into bite sized pieces. Slice the scallion into 1 inch pieces. ",
            "Into a large bowl, combine the flour, potato starch and salt and stir. Then add in the kimchi, kimchi juice, scallion and water. Stir the mixture until a thick batter forms and everything is well combined. ",
            "Heat a large pan over medium high heat. Brush the pan with 1 tsp of oil (omit for oil-free). Pour all the batter onto the pan. Spread the batter to create an even layer. Fry until browned and crispy and the edges look slightly cooked. Flip the pancake and cook for another 3-4 minutes, or until browned and crispy. ",
            "While waiting, prepare the dipping sauce by combining all the ingredients together. ",
            "Once the pancakes are finished, slice into 6-8 pieces and serve with the dipping sauce. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-kimchi-pancakes-kimchijeon",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/vegan-kimchi-pancakes-1-of-1.jpg"
    },
    {
        "name": "Vegan Key Lime Pie",
        "servings": "6 pies",
        "ingredients": [
            "3/4 cup dates (110g)",
            "1/3 cup almond flour (32g)",
            "2/3 cup buckwheat, divided (70g)",
            "1 tbsp coconut butter (15g)",
            "½ tsp fine sea salt",
            "1/3 cup + 2 tbsp full fat coconut milk",
            "1/4 cup lime juice",
            "½ tsp lime zest",
            "¼ tsp matcha powder",
            "1 tsp vanilla",
            "3–4 tbsp coconut condensed milk",
            "1/2 tsp agar agar",
            "1 tbsp corn starch"
        ],
        "instructions": [
            "Crust: Into the food processor, add in half the buckwheat and process until it resembles flour. Add in the rest of the crust ingredients and pulse blend until it becomes similar to the texture of dough. Divide the dough into 6 and press into muffin tins. Place that into the freezer to chill.",
            "Filling: Over medium high heat, add the lime juice, vanilla, condensed milk and cornstarch. Whisk consistently until it begins to boil. Then add in the coconut milk, agar, matcha powder and lime zest. Stir constantly until agar is completely dissolved (around 1 minute). ",
            "Assemble: Pour the filling over the chilled tart crust. Place it into the fridge to chill until the filling is set. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-key-lime-pie",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/vegan-key-lime-pie-2-of-2.jpg"
    },
    {
        "name": "Vietnamese Vermicelli Noodle Salad with Tofu",
        "servings": "2–3 servings",
        "ingredients": [
            "3 tbsp rice vinegar ",
            "1/4 cup lime juice",
            "1/4 cup vegan fish sauce*",
            "2 tbsp coconut sugar ",
            "2 garlic cloves, finely minced",
            "1 red chilli, deseeded and sliced",
            "1/2 package vermicelli rice noodles (200g)",
            "1 block smoked tofu (250g)",
            "1 large carrot, julienned (160g)",
            "2 cucumbers, julienned (160g)",
            "8 lettuce leaves (120g)",
            "1/2 cup cilantro (20g)",
            "1/2 cup mint leaves (18g)",
            "1/4 cup chopped roasted peanuts (36g)",
            "lime wedges to serve "
        ],
        "instructions": [
            "Soak: the rice noodles in a large bowl of water for 15 minutes or until softened. ",
            "Dressing: add all the ingredients into a small bowl and combine.",
            "Tofu: Cube the tofu into 1/2 inch pieces. ",
            "Vegetables & Herbs: Julienne the carrots and cucumbers. Shred the lettuce. Roughly chop the herbs. ",
            "Noodles: Over medium heat, add in the noodles with a bit of the soaking water to finish cooking. Drain and rinse with cold water. Transfer to a large mixing bowl. ",
            "Assemble: Add the vegetables, herbs, tofu, peanuts and dressing into the bowl with the vermicelli noodles. Toss until everything is evenly distributed. "
        ],
        "link": "https://okonomikitchen.com/vietnamese-vermicelli-noodle-salad-with-tofu",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/vietnamese-vermicelli-noodle-salad-with-tofu-1-of-1-1024x683.jpg"
    },
    {
        "name": "Pad Thai Zucchini Noodles with Jackfruit Chicken",
        "servings": "2 Servings",
        "ingredients": [
            "2 tbsp soy sauce",
            "1 tbsp vegan fish sauce (or sub more soy sauce)",
            "2 tbsp rice vinegar",
            "1 tbsp coconut sugar",
            "2 garlic cloves, minced",
            "1/2 tbsp ginger  ",
            "3 tbsp water to thin as needed",
            "1/2 tsp red pepper flakes optional",
            "¼ c peanut butter (62g)",
            "1 lime, juiced ",
            "1 can jackfruit (300g)",
            "2 medium zucchini (400g)",
            "1 medium carrot (100g)",
            "1 c red pepper thinly sliced (120g)",
            "2 scallions, green parts only ",
            "handful of of peanuts (around 1/4 cup)",
            "handful of cilantro"
        ],
        "instructions": [
            "Preheat oven to 400F.*",
            "In a small bowl combine soy sauce, vegan fish sauce, rice vinegar, coconut sugar, garlic, ginger, water and red pepper flakes. ",
            "Drain and rinse the jackfruit. Shred the jackfruit using two forks and then squeeze out any excess liquid. Add 2 tbsp of the dressing and mix well. Spread the jackfruit on a lined baking tray and drizzle a bit of oil and toss. Place the jackfruit into the oven 15 minutes or until lightly browned. ",
            "Add the peanut butter and lime juice in dressing bowl and whisk until combined.",
            "In a large pan over medium high heat, add the spiralized carrots and cook for 1 minute. Add in the spiralized zucchini and bell pepper, and season with salt and pepper. Allow to cook for 3 minutes. Let it sit for a couple minutes and drain any excess liquid.  Add in the finished jackfruit along with the sauce and mix to combine. Serve with green onions, crushed peanuts or cashews and cilantro."
        ],
        "link": "https://okonomikitchen.com/pad-thai-zucchini-noodles-with-jackfruit-chicken",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/pad-thai-zucchini-noodles-with-jackfruit-chicken-1-of-1-1.jpg"
    },
    {
        "name": "Vegan Coffee Jelly Dessert",
        "servings": "2 servings",
        "ingredients": [
            "2 cups water (500ml)",
            "1 tbsp high quality instant coffee granules ",
            "2 tsp Japanese agar* (8g)",
            "3 tsp sugar (15g)",
            "1/2 cup coconut evaporated milk (125g)*",
            "3 tbsp coconut condensed milk (45g)"
        ],
        "instructions": [
            "Bring 2 cups of water to a boil in a small pot. Turn down the heat to a simmer and add in the agar, coffee granules and sugar. Use a whisk to stir every few seconds, for around 2-3 minutes or until the coffee and sugar dissolves completely. ",
            "Remove from the heat and transfer into a shallow dish. Allow it to cool for 5-8 minutes or until room temperature. You can speed the process by placing the shallow dish over ice packs. Place into the fridge and allow to chill until firm.",
            "Make the sweet milk by combining the evaporated coconut milk with the condensed milk with a whisk and place in the fridge to chill. ",
            "Using a sharp knife, cut the coffee jelly into cubes inside the dish. Scoop coffee cubes into cups and pour over the sweet milk. Optional: for the gradient effect of the coffee colour on top, slow add in 1 shot of chilled espresso. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/vegan-coffee-jelly-dessert",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/vegan-coffee-jelly-dessert-recipe-1-of-1-1024x683.jpg"
    },
    {
        "name": "No-Bake Salted Caramel Bars",
        "servings": "8 Bars",
        "ingredients": [
            "1.5 cups raw cashews (198g)",
            "14 soft dates (168g)",
            "1 cup hazelnuts, divided in half (150g)",
            "1.5 tbsp coconut nectar (36g)",
            "3 tsp salt (9g)",
            "3 tsp vanilla (12g)"
        ],
        "instructions": [
            "Add the cashews, dates, around half the hazelnuts, coconut nectar, salt and vanilla extract into a food processor. Process until it comes together into a dough like consistency. Add in the rest of the hazelnuts and pulse 8-10 times, just enough so they are spread throughout the “dough” but not broken up too small.",
            "Press into a 15×15 cm tray and place into the fridge for an hour. Take them out of the fridge and cut into 8-10 bars. Store in a air tight container in the fridge for up to 2 weeks."
        ],
        "link": "https://okonomikitchen.com/no-bake-salted-caramel-bars",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/06/nobakecaramelbarslarabarrecipe-3.jpg"
    },
    {
        "name": "Summer Vegetable Thai Green Curry",
        "servings": "3–4 servings",
        "ingredients": [
            "3 garlic cloves, minced",
            "1/2 tbsp ginger, minced",
            "4–5 green curry paste",
            "1 medium onion, quartered (140g)",
            "1 medium Japanese eggplant (250g)",
            "1 package of firm tofu (450-500g)",
            "1 14 oz can coconut milk",
            "1 cup vegetable broth",
            "2 tbsp soy sauce",
            "1–2 tbsp coconut sugar",
            "1 pack of okra (250g)",
            "1 red bell pepper (240g)",
            "To serve: rice, cilantro, green onions & lime wedge"
        ],
        "instructions": [
            "In a large non stick sauce pan, fry the garlic, ginger and curry paste until fragrant over medium high heat (2 minutes). Add in the onions, eggplant and tofu, and fry for another 3-5 minutes.",
            "Add in the vegetable broth, soy sauce and coconut milk. Lower the heat to a medium and allow it to simmer for 5 minutes.",
            "Add in the okra, tofu & bell pepper and cook for another 3-5 minutes. Taste the sauce and add extra soy sauce, salt, lime juice and/or sugar as needed. Do not continue to simmer and take off the heat, sauce should be thin with the vegetables slightly under cooked (it will continue to cook as long as it is heated).",
            "Serve over rice and garnish with green onions, cilantro and limes."
        ],
        "link": "https://okonomikitchen.com/summer-vegetable-thai-green-curry",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/06/vegansummerthaivegetablecurry-3.jpg"
    },
    {
        "name": "Vegan Yakisoba",
        "servings": "2 servings",
        "ingredients": [
            "2 tbsp vegan mushroom sauce",
            "2 tbsp sugar-free ketchup",
            "2 tbsp Bull Dog Worcester sauce*",
            "1–2 tsp sugar",
            "1 tbsp soy sauce",
            "2 servings of yakisoba noodles* (200g)",
            "1/2 medium onion (80g)",
            "1 cup bean sprouts (110g)",
            "1 cup cabbage, chopped (100g)",
            "3 green onions, greens and whites separated (60g)",
            "1/2 cup soy curls (60g)",
            "4 dried shiitake mushrooms, rehydrated and sliced (20g)",
            "1/2 small carrot, thinly sliced (80g)",
            "black pepper (to taste)",
            "Beni Shoga (pink pickled ginger)",
            "Aonori (dried seaweed)"
        ],
        "instructions": [
            "In a small bowl, whisk together the yakisoba sauce until mixed together.",
            "In a wok or large pan, fry the sliced onions, the white parts of the scallions, carrots and soy curls until onions becomes tender 1-2 minutes. Add the cabbage, bean sprouts and shiitake mushrooms and fry for another 1 minute. Add in the sliced green onions and noodles, and stir fry for another 1 minute. Add in the yakisoba sauce and mix until everything is well coated. Transfer yakisoba to serving places and top with aonori and serve with shoga."
        ],
        "link": "https://okonomikitchen.com/vegan-yakisoba",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/veganyakisoba-11.jpg"
    },
    {
        "name": "Easy Vegan Caramel Corn",
        "servings": "6 cups",
        "ingredients": [
            "1/2 cup popcorn kernels, popped // 10 cups popped popcorn (105g)",
            "3 tbsp coconut butter (45g)",
            "1/4 cup coconut sugar (48g)",
            "1/4 cup maple syrup (78g)",
            "2 tbsp water",
            "1 tsp vanilla",
            "1/2 tsp salt",
            "1/4 tsp baking soda"
        ],
        "instructions": [
            "Preheat oven to 150 °C. Line two baking trays with silicon baking mat or parchment paper.",
            "In a small saucepan, add in the coconut butter, maple syrup, coconut sugar and water over medium high heat. Stir frequently and allow bubbles to form. Once at a boil, add in the vanilla and salt and stir for 1 minute. Add in the baking soda and stir vigorously just until the colour starts to change.",
            "Remove from the heat and quickly pour the caramel over the popped popcorn in a large bowl. Toss using a large spatula until popcorn is evenly coated with the caramel. Spread over the baking tray, making sure the popcorn pieces do not over lap and bake in the oven for 5-8 "
        ],
        "link": "https://okonomikitchen.com/easy-vegan-caramel-corn",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/vegan-caramel-corn-recipe-683x1024.png"
    },
    {
        "name": "Mango Coconut Tofu Curry",
        "servings": "3–4",
        "ingredients": [
            "3 garlic cloves, minced",
            "1 tsp ginger, minced",
            "2 small onions (150g)",
            "1 block firm tofu, cubed (450g)",
            "4–5 tbsp Thai Red Curry Paste",
            "1 13 oz can coconut milk*",
            "3/4 – 1 c cup veg  broth",
            "1 large mango (around 3/4–1 cup of flesh)",
            "3 tbsp soy sauce",
            "1 lime, juiced",
            "1/2 tsp red pepper flakes/chili flakes",
            "1 red bell pepper, chopped (210g)",
            "1 green bell pepper, chopped (250g)",
            "1 small broccoli head, cut into florets (200-250g)",
            "To Serve: Jasmine rice, fresh cilantro, green onion tops and lime wedges"
        ],
        "instructions": [
            "In a large shallow pan fry garlic, ginger, onion and chili over medium high heat until onions are slightly translucent. Add in the tofu and pan fry until browned (around 3-5 minutes). Add in the curry paste and fry for another 2 minutes (or until fragrant).",
            "Add in the coconut milk and vegetable broth. Stir to dissolve the curry paste and allow the curry to come to a simmer. Add in the mango puree, soy sauce and lime juice. Add in the bell peppers and broccoli. Then, turn the heat down to a medium and simmer for 12-15 minutes.",
            "Taste & adjust seasoning by adding in more soy sauce, lime juice chili and salt.",
            "Serve with jasmine rice and top with cilantro and lime wedges."
        ],
        "link": "https://okonomikitchen.com/mango-coconut-tofu-curry",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/veganmangococonuttofucurry-3.jpg"
    },
    {
        "name": "Sticky Lemon Tofu (Date Sweetened)",
        "servings": "2–3 servings",
        "ingredients": [
            "1 block of medium firm OR firm tofu (450g)",
            "2 tbsp cornstarch",
            "Optional: 1 tsp garlic powder",
            "Sticky Lemon Sauce:",
            "1/3 cup vegetable broth/water (80ml)",
            "1 cup dates (148g)",
            "1/3 c cup lemon juice (80ml)",
            "2 tsp lemon zest",
            "1.5 tbsp soy sauce",
            "4 tsp corn starch + 1 tbsp water",
            "½ tsp salt and pepper (+ more to taste)",
            "Toppings: sesame seeds & green onion tops"
        ],
        "instructions": [
            "    First prepare your tofu. After squeezing out as much liquid from the tofu cut into 3/4-1 inch cubes. Place into a container along with corn starch and garlic powder (if using). Gently shake the container until the tofu is coated with the corn starch. Place into lined air fryer at 400 for 12 minutes. Shake the basket and flip the tofu and air fry for another 12-15 minutes (or until crispy). I used medium firm tofu, so if using firm tofu you may need to reduce the time by 1-3 minutes.",
            "For the sticky lemon sauce, add all the ingredients into the blender except the corn starch and water. I recommend straining the sauce at this point but if you’re in a pinch this step is not crucial. Add the sauce in a small non-stick pan over medium high and bring to a simmer. While waiting, mix the corn starch and water to make a slurry. Once the sauce begins to simmer, reduce to medium low and whisk in the slurry. Continue whisking and simmering for 1 more minute, until thick. Add in the lemon zest. Taste and adjust by adding in more salt. Once nice and thick reduce the temp to the lowest temperature until the tofu is finished.",
            "Once the tofu is nice and crispy, toss in the thickened sauce until all pieces are evenly coated. Immediately serve with your grain of choice, pair it with some of your favorite vegetables and top with sesame seeds and/or green onion tops!"
        ],
        "link": "https://okonomikitchen.com/sticky-lemon-tofu-date-sweetened",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/stickylemontofudatesweetened-3.jpg"
    },
    {
        "name": "Strawberry Tahini Chia Pudding",
        "servings": "4 servings",
        "ingredients": [
            "1 3/4 c frozen (or fresh) strawberries, thawed (400g)",
            "1 cup soy milk (250ml)",
            "3 tbsp tahini (48g)",
            "1 block soft tofu (250g)",
            "1/2 cup chia seeds (80g)",
            "3–4 tbsp maple syrup (60-80g)",
            "1 tsp vanilla extract"
        ],
        "instructions": [
            "Add the strawberries, soy milk, tahini, tofu, maple syrup and vanilla extract into a high speed blender, and blend until smooth.",
            "Add in the chia seeds and pulse blend a few times (around 8-10 quick pulses), just enough to mix in the chia seeds. If you see large clumps, use a whisk to try and break them up.",
            "Divide into 4 air tight containers or jars and store in the fridge for atleast 1 hour (preferably overnight).",
            "Before eating, mix and add in a bit of soy milk if needed to desired consistency. Top with your favourite toppings and enjoy!"
        ],
        "link": "https://okonomikitchen.com/strawberry-tahini-chia-pudding",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/strawberrytahinichiapuddingvegan-12.jpg"
    },
    {
        "name": "Air Fryer BBQ Cauliflower Wings",
        "servings": "1 serving",
        "ingredients": [
            "2/3 cup of homemade Coffee Infused BBQ Sauce (or your choice of BBQ sauce",
            "1 lbs of cauliflower florets (around 1 medium head)",
            "1/3 cup of flour (AP or gluten-free)",
            "1/2 cup of soy milk",
            "salt & pepper to taste"
        ],
        "instructions": [
            "Pre-heat your air fryer to 375 F (for 4 minutes).",
            "Start by cutting up your cauliflower into “wing” sized pieces.",
            "Whisk together the flour and soy milk until smooth. It should be the consistency of a typical dredge (or pancake mix). Start with the given amount of soy milk. If too thick, add a bit more water (1 tbsp at a time).",
            "Coat each cauliflower piece with the dredge then place into the air fryer basket (do your best to not let them touch). Let it air fry for 12 minutes",
            "Take them out and then dip them in the bbq sauce and place back into the air fryer for an additional 12-15 minutes or until crispy."
        ],
        "link": "https://okonomikitchen.com/air-fryer-bbq-cauliflower-wings",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/veganbbqcauliflowerwings-5.jpg"
    },
    {
        "name": "No Bake Cookie Dough Brownies",
        "servings": "9 servings",
        "ingredients": [
            "3/4 cup dates (130g)",
            "1/2 cup chocolate almond butter (130g)",
            "1/3 cup cacao powder (28g)*",
            "1–2 tbsp coconut flour (7-14g)**",
            "3 tbsp coconut butter (45g)",
            "4 tbsp almond butter (60g)",
            "1 tsp vanilla extract",
            "1 cup almond flour (110g)",
            "1 tbsp coconut flour (7g)",
            "3 tbsp coconut sugar (45g)",
            "1/4–1/3 cup mini chocolate chips (45g) (depending on how chocolate-y you like your cookie dough, start with lesser amount)"
        ],
        "instructions": [
            "Line a 6×6 inch baking tray with parchment paper.",
            "For the brownie layer: into a food processor add in the dates, chocolate almond butter and lesser amount of coconut flour and process until incorporated and a dough like mixture forms. If the dough seems too sticky or wet, add in the extra tbsp of coconut flour little by little. Press that into the lined baking pan evenly. Place that into the freezer while making the cookie dough layer.",
            "Add in the melted coconut butter and warmed almond butter into a medium sized bowl and stir to combine. Then add in the almond flour, coconut flour and coconut sugar. Mix until a sandy like mixture forms. You may need to use your hands in this step to incorporate well. Add in the chocolate chips and give it one last mix.",
            "Take the pan out of the freezer, then spread the cookie dough mixture evenly. Press the cookie dough layer down into the brownie layer as evenly and flat as possible. A flat potato masher OR a measure cup with a flat surface can be used to help achieve a flat top.",
            "Place into the freezer for 15 minutes or in the fridge for 30 minutes. Once out of the fridge, slice into 9 even squares and enjoy!"
        ],
        "link": "https://okonomikitchen.com/no-bake-cookie-dough-brownies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/NoBakeCookieBrowniesVeganGlutenFree-10.jpg"
    },
    {
        "name": "Chocolate Covered Stuffed Dates 5 Ways",
        "servings": "15 stuffed dates, 3 flavours of each",
        "ingredients": [
            "15 dates",
            "1 heaping tbsp cookie butter",
            "1 heaping tbsp of coconut butter (I used browned coconut butter)",
            "1 heaping tbsp tahini",
            "1/8 tsp miso paste",
            "1 heaping tbsp almond butter",
            "1/8 tsp vanilla extract",
            "1 heaping tbsp peanut butter",
            "2 pretzel sticks",
            "1/2 cup chocolate chips"
        ],
        "instructions": [
            "Pit your dates by slicing one side and removing the pit.",
            "Salted Tahini Stuffed Date: in a small bowl mix together the tahini and miso paste until combined.",
            "Almond Espresso Stuffed Date: in a small bowl mix together the almond butter, vanilla extract and espresso powder until combined",
            "Stuff each date with 1-1.5 tsp of each mixture. For the peanut butter pretzel, place a pretzel right in the center of the date once you will it with peanut butter. Close each date and put it on a parchament lined tray. Place the tray into the fridge.",
            "Place your chocolate into a small bowl and microwave in 30 second intervals. Mix after each interval until completly melted.",
            "Dip each stuffed date into the chocolate until completly covered. I used a tooth pick for this, but you can also use a fork.",
            "Place each chocolate covered date back onto the tray and back into the fridge to let the chocolate harden for atleast 10 minutes. Store in a containerin the fridge and enjoy anytime!"
        ],
        "link": "https://okonomikitchen.com/chocolate-covered-stuffed-dates-5-ways",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/ChcolateCoveredStuffedDates-10.jpg"
    },
    {
        "name": "How to Make Browned Coconut Butter",
        "servings": "1 cup",
        "ingredients": [
            "3 cups unsweetened shredded coconut OR 1 cup coconut butter"
        ],
        "instructions": [
            "Add the shredded coconut flakes into a blender and blend until a smooth butter forms.",
            "You may need to scrape down the sides a couple of times to help it blend.",
            "Once it becomes quite smooth and liquidy, transfer the coconut butter into a non-stick pan or a small shallow pot.",
            "Turn the heat up to a medium high. Once the coconut butter starts to heat up give it a good mix. Then, turn the heat down to a medium low and continue to stir quickly every time it begins to bubble. This helps brown the bottom layer without burning. Continue for around 12-15 minutes or until the coconut butter becomes a light brown colour.",
            "Transfer to a air tight jar and store at room temperature. Bake with it, top all your food with it, or eat it stright out of the jar!"
        ],
        "link": "https://okonomikitchen.com/how-to-make-browned-coconut-butter",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/BrownedCoconutButterRecipe-4-2.jpg"
    },
    {
        "name": "Lemon Poppy Seed Oat Bars",
        "servings": "5-6 bars",
        "ingredients": [
            "2 cups gluten free rolled oats (160g)",
            "1/2 cup lemon juice",
            "1/3 cup water",
            "1/3 cup brown rice syrup (88g)*",
            "1/4 cup coconut butter (60g)**",
            "2 tbsp cashew butter (30g)***",
            "1.5 tbsp poppy seeds OR chia seeds",
            "1 tsp vanilla extract",
            "1/2 tsp salt",
            "Optional: 1/4 cup powdered sugar + 2 tsp lemon juice for lemon icing drizzle."
        ],
        "instructions": [
            "Preheat oven to 350° F.",
            "Add 1.5 cup of oats into food processor and pulse 6-10 times or until coarsely ground Add in the other half of oats, water and lemon juice. Mix with a spoon and let it sit for 3-5 minutes.",
            "If your coconut butter is not already runny, melt it down. Then into a large bowl, combine it with the rice malt syrup, cashew butter, lemon zest, vanilla and salt.",
            "Add in the oats and poppy seeds, and mix until combined.",
            "Transfer the batter into a line 8×4 inch bread pan or mini loaf pans. Spread evenly so that the top it flat and even.",
            "Bake for 20-25 minutes, rotating half way. The edges will be slightly firmer and more browned.",
            "Once removed from the oven, allow it to cool in the pan for 20 minutes. Carefully remove from the pan and place on cooling rack for another 10 minutes. In the meantime, prepare the lemon icing by combining the powdered sugar and lemon juice in a small bowl until desired consistency. Divide into 5-6 bars and enjoy!"
        ],
        "link": "https://okonomikitchen.com/lemon-poppy-seed-oat-bars",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/VeganGlutenFreeLemonPoppySeedOatBars-11.jpg"
    },
    {
        "name": "Vegan Mapo Tofu",
        "servings": "4 Servings",
        "ingredients": [
            "4 tbsp doubanjiang paste (60g)",
            "2.5 tbsp black bean paste (50g)",
            "2 tbsp mirin or sake (30g)",
            "2 tbsp miso paste (40g)",
            "2 tbsp sesame oil (28g)",
            "2.5 tbsp corn starch (15g)",
            "1/2 cup water",
            "2 inches of ginger, grated",
            "2 large garlic cloves, minced",
            "1 package of shimeji mushrooms, cut into small pieces (200g)",
            "1 block of firm pressed tofu, crumbled (150g)*",
            "4 blocks of soft tofu, cubed (800g)",
            "2 green onion tops"
        ],
        "instructions": [
            "In a small bowl, mix the doubanjian, mirin, miso paste, sesame oil and fermented black bean paste, corn starch and water until combined.",
            "In a large skillet wver medium high heat, sautee the garlic and ginger with a little bit of sesame oil (or water for oil-free) until fragrant.",
            "Add in the shimeji mushrooms and pressed crumbled tofu until slightly browned.",
            "Add the sauce and once it begins to lightly boil, add in the tofu and toss gently until the tofu is covered in the thickened sauce.",
            "Plate on a serving dish and top with scallions and sesame seeds."
        ],
        "link": "https://okonomikitchen.com/vegan-mapo-tofu",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/EasyVeganMapoTofu-1.jpg"
    },
    {
        "name": "Curried Quinoa & Lentil Stew",
        "servings": "4 Servings",
        "ingredients": [
            "1 medium onion, sliced",
            "3 garlic cloves minced",
            "1 inch ginger, grated",
            "2 tbsp curry powder",
            "1 tsp cumin",
            "1 tsp garam masala",
            "1 28 oz diced tomatoes",
            "3 cups vegetable broth",
            "1 14 oz can coconut milk",
            "1 cup lentils, rinsed*",
            "1 cup dry quinoa, rinsed",
            "1 cup carrots, cut into half moons",
            "2 large handfuls of spinach",
            "handful of cilantro, green onion tops and dairy free yogurt for garnish"
        ],
        "instructions": [
            "On medium high heat, add onions, garlic and ginger into a large pot and fry for 1 minute. Add in the curry power, cumin, graham masala and fry until fragrant (around 3 minutes).",
            "Add in the diced tomatoes, carrots, vegetable broth, coconut milk, split years, quinoa, salt and pepper. Give it a stir, allow it to come to a boil and then bring the temperature down to low.",
            "Cover, and allow to simmer for 20 minutes (stirring occasionally), or until lentils are cooked through. Add in the spinach and allow it to wilt down. Season with salt and pepper.",
            "Serve in a bowl and garnish with cilantro, green onions and coconut yogurt. Enjoy!"
        ],
        "link": "https://okonomikitchen.com/curried-quinoa-&-lentil-stew",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/CurriedQuinoaandLentilStew-1-2.jpg"
    },
    {
        "name": "Air Fryer Caramelized Bananas",
        "servings": " servings12 Cups",
        "ingredients": [
            "2 bananas",
            "1/4 of a lemon, juiced",
            "1 tbsp coconut sugar",
            "optonal toppings: cinnamon, nuts, coconut cream, yogurt, granola… etc."
        ],
        "instructions": [
            "Wash your bananas with the peel on, then slice them straight down the middle, length wise",
            "Squeeze lemon juice over top of each banana",
            "If using cinnamon mix with in with the coconut sugar, then sprinkle over top of the bananas until coated",
            "Place into parchment lined air fryer for 6-8 minutes at 400F",
            "Once taken out of the airfryer, eat as is or top with your favourite toppings and enjoy!"
        ],
        "link": "https://okonomikitchen.com/air-fryer-caramelized-bananas",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/AirFryerCaramelizedBananas-3.jpg"
    },
    {
        "name": "Vegan Lemon Bars",
        "servings": "9 squares",
        "ingredients": [
            "1 cup almond flour (130g)",
            "1/4 cup + 2 tbsp coconut flour (50g)",
            "3 tbsp cup maple syrup (45g)",
            "1/3 cup creamed coconut (90g)",
            "1 pack of firm-soft tofu (300g)",
            "1/2 cup lemon juice",
            "1/3 cup dry sweetener of choice",
            "2 tbsp corn starch",
            "1 tsp vanilla extract",
            "1 tsp lemon zest"
        ],
        "instructions": [
            "Preheat oven to 350F",
            "Combine almond flour, coconut flour, maple syrup and melted creamed coconut into a bowl and combine until it comes together and forms a dough, then press into a 8×8 inch lined baking tin",
            "Place into the oven for 10 minutes",
            "In the meantime, prepare the filling by adding in the rest of the ingredients into a high speed blender",
            "Once the crust comes out, allow it to cool until warm to the touch, then pour over the filling and place back into the oven for 50 minutes, rotating the baking tin half way",
            "Allow it to cool completely before serving"
        ],
        "link": "https://okonomikitchen.com/vegan-lemon-bars",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/HealthyVeganLemonBars-9.jpg"
    },
    {
        "name": "Vegan Sesame Tantanmen (Homemade Ramen)",
        "servings": "2 servings",
        "ingredients": [
            "3 tbsp tahini",
            "2 tbsp soy sauce",
            "1/2 tbsp rice vinegar",
            "1 tbsp sesame oil",
            "1 tsp rayu (Japanese red chili oil)",
            "1 cup soy milk (250ml)",
            "1.5 cup veg broth (300ml)",
            "100 g soy meat or tofu",
            "1 tsp garlic, minced",
            "1 tsp ginger, minced",
            "1/2 tbsp soy sauce",
            "1 tsp sake (optional)",
            "1/2 tbsp miso paste",
            "1 tsp red chili oil",
            "2 portions of ramen noodles",
            "1/2 head of small cabbage, shredded",
            "1 cup bean sprout",
            "1/2 cup corn",
            "Additional garnishes: crushed peanuts, sesame seeds, sliced green onions, sliced garlic tops, soy sauce and rayu/red chili oil."
        ],
        "instructions": [
            "If using soy meat, soak in hot water for 5 minutes. If using tofu, crumble tofu until they resemble minced meat.",
            "Heat a small skillet over medium high heat with some sesame oil, 2 cloves of minced garlic and ginger. Add in the soy/tofu crumbles and then add in the sake, soy sauce, miso paste and red chili oil. Fry until the crumbles get slightly crispy (around 3-5 minutes)",
            "Prep the vegetables by slicing them and steaming them for around 3 minutes.",
            "Bring a medium pot to a boil and then cook the ramen according to instructions (around 5 minutes)",
            "Combine all the ingredients except the soy milk and broth into a bowl until a paste forms.",
            "Heat the soy milk and vegetable stock over medium low heat, then reduce to low as soon as you start to see bubbles. Whisk in the paste made earlier until dissolved.",
            " Place cooked noodles into a bowl. Pour over half the broth. Add on the fried minced soy meat, vegetables, additional garnishes and chili oil."
        ],
        "link": "https://okonomikitchen.com/vegan-sesame-tantanmen-homemade-ramen",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/VeganTantanmenHomemadeRamen-2.jpg"
    },
    {
        "name": "Vegan Chocolate Cake made with Eggplant",
        "servings": "6 servings",
        "ingredients": [
            " 2 eggplants, steamed (300g raw)",
            "1/3 cup semi-sweet chocolate chips",
            "1/3 cup maple syrup",
            "1 tsp vanilla extract",
            "1 tbsp vinegar (ACV or balsamic)",
            "2/3 cup cacao powder (58g)",
            "2/3 cup cake flour OR all purpose gluten free flour blend (80g)",
            "1/4 cup almond flour (30g)",
            "1.5 tsp baking powder",
            "1/2 tsp baking soda",
            "1 chia egg (1 tbsp ground chia seeds 2 tbsp water)",
            "1/2 tsp salt"
        ],
        "instructions": [
            "Preheat oven to 350F.",
            "Chop the eggplant and steam until tender (around 5 minutes)",
            "In a large bowl, sift and mix in the cacao powder, cake flour, almond flour, baking powder, baking soda and salt",
            "In a blender, add in the cooked eggplant, chocolate chips, maple syrup, vanilla and vinegar and blend until smooth",
            "Pour mixture into the bowl with the dry ingredients and mix",
            "Half way through, add in the chia egg and fold to mix",
            "Divide the batter into 6 large greased muffin tins*",
            "Place into oven for 30 minutes rotating half way or until toothpick comes out clean",
            "Serve with chocolate frosting (or your favourite frosting recipe)!"
        ],
        "link": "https://okonomikitchen.com/vegan-chocolate-cake-made-with-eggplant",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/VeganChocolateCakewithEggplant-6.jpg"
    },
    {
        "name": "Matcha Mochi Waffles",
        "servings": "8 waffles",
        "ingredients": [
            "1.5 c glutinous rice flour",
            "1/4 c gluten free flour",
            "3 tbsp coconut sugar",
            "1 tbsp matcha",
            "1 tsp baking powder",
            "1 c coconut milk + 1 tbsp lemon juice",
            "2 tbsp coconut yogurt or cream",
            "1 tsp vanilla extract"
        ],
        "instructions": [
            "Start by making the buttermilk by mixing together the coconut milk and lemon juice",
            "Sift all the dry ingredients into a large bowl",
            "Then add in the wet ingredients and mix to combine (using your hands might be easier for this, the dough should not be runny)",
            "Once it’s mixed, divide the batter dough into 8 and place them into your waffle maker on medium heat for 3-5 minutes",
            "Serve immediately with fruit, yogurt, whip cream or red bean paste!"
        ],
        "link": "https://okonomikitchen.com/matcha-mochi-waffles",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/VeganMatchaMochiWaffles284of1829.jpg"
    },
    {
        "name": "Chocolate Chip Tahini Cookies",
        "servings": "No servings data",
        "ingredients": [
            "1 tbsp flax meal + 3 tbsp aquafaba (or water) mixed for 5 minutes",
            "1/2 cup tahini",
            "1/3 cup + 1 tbsp maple syrup",
            "2 tbsp coconut sugar",
            "1 tsp vanilla",
            "3/4 cup + 2 tbsp almond flour (100g)",
            "1/4 cup oat flour (30g)",
            "1/2 tsp baking powder",
            "1/2 tsp baking soda",
            "1/8 tsp salt",
            "1/3 cup chocolate chips"
        ],
        "instructions": [
            "Preheat oven to 180c",
            "Mix in the tahini, maple syrup, coconut sugar, vanilla & flax egg in a bowl until a smooth consistency",
            "Add in your almond flour, oat flour, baking soda, baking powder and mix.",
            "Fold in your chocolate chips",
            "Add a 1-2 tbsp of dough onto a lined baking tray.",
            "Place them into the oven for 12-15 minutes. The longer the baking time, the more crisp the cookies will come out.",
            "Let them cool & enjoy with almond milk!"
        ],
        "link": "https://okonomikitchen.com/chocolate-chip-tahini-cookies",
        "image": "https://okonomikitchen.com/wp-content/uploads/2019/07/33_image-asset.jpg"
    }
]